[Killed] EqualityOperator
src/components/size/Size.tsx:23:11
       setSize(minSize);
       onSizeChange(minSize);
     } else {
-      if (currentSize > maxSize) {
+      if (currentSize <= maxSize) {
         setSize(maxSize);
         onSizeChange(maxSize);
killedBy: Control Size check max boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 50
Received: 51
