[Timeout] BlockStatement
src/services/auth/Auth.tsx:24:19
     ""
     // () => localStorage.getItem("cellular-automaton.user") || ""
   );
-  useEffect(() => {
-    setUser(localStorage.getItem("cellular-automaton.user") || "");
-    console.log("Auth useEffect");
-  });
+  useEffect(() => {});
   return {
     user,

[Killed] BlockStatement
src/services/auth/Auth.tsx:30:34
   });
   return {
     user,
-    login: (userName: string) => {
-      console.log("Auth Login");
-      !!userName && localStorage.setItem("cellular-automaton.user", userName);
-      !!userName && setUser(userName);
-    },
+    login: (userName: string) => {},
     logout: (callback: () => void) => {
       console.log("Auth Logout");
killedBy: Check Login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Survived] StringLiteral
src/services/auth/Auth.tsx:31:19
   return {
     user,
     login: (userName: string) => {
-      console.log("Auth Login");
+      console.log("");
       !!userName && localStorage.setItem("cellular-automaton.user", userName);
       !!userName && setUser(userName);

[Killed] LogicalOperator
src/services/auth/Auth.tsx:32:7
     user,
     login: (userName: string) => {
       console.log("Auth Login");
-      !!userName && localStorage.setItem("cellular-automaton.user", userName);
+      !!userName || localStorage.setItem("cellular-automaton.user", userName);
       !!userName && setUser(userName);
     },
killedBy: Check Login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Killed] BooleanLiteral
src/services/auth/Auth.tsx:32:8
     user,
     login: (userName: string) => {
       console.log("Auth Login");
-      !!userName && localStorage.setItem("cellular-automaton.user", userName);
+      !userName && localStorage.setItem("cellular-automaton.user", userName);
       !!userName && setUser(userName);
     },
killedBy: Check Login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Killed] ConditionalExpression
src/services/auth/Auth.tsx:33:7
     login: (userName: string) => {
       console.log("Auth Login");
       !!userName && localStorage.setItem("cellular-automaton.user", userName);
-      !!userName && setUser(userName);
+      true;
     },
     logout: (callback: () => void) => {
killedBy: Check Login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Killed] ConditionalExpression
src/services/auth/Auth.tsx:33:7
     login: (userName: string) => {
       console.log("Auth Login");
       !!userName && localStorage.setItem("cellular-automaton.user", userName);
-      !!userName && setUser(userName);
+      false;
     },
     logout: (callback: () => void) => {
killedBy: Check Login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Killed] BlockStatement
src/services/auth/Auth.tsx:35:39
       !!userName && localStorage.setItem("cellular-automaton.user", userName);
       !!userName && setUser(userName);
     },
-    logout: (callback: () => void) => {
-      console.log("Auth Logout");
-      localStorage.removeItem("cellular-automaton.user");
-      setUser("");
-      callback();
-    },
+    logout: (callback: () => void) => {},
   };
 };
killedBy: Check Logout
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] StringLiteral
src/services/auth/Auth.tsx:37:31
     },
     logout: (callback: () => void) => {
       console.log("Auth Logout");
-      localStorage.removeItem("cellular-automaton.user");
+      localStorage.removeItem("");
       setUser("");
       callback();

[NoCoverage] BlockStatement
src/services/auth/Auth.tsx:49:35
   return <authContext.Provider value={auth}>{children}</authContext.Provider>;
 };
 
-export const AuthConsumer = () => {
-  return React.useContext(authContext);
-};
+export const AuthConsumer = () => {};
 
 export const RequireAuth = ({ children }: { children: JSX.Element }) => {

[Survived] ConditionalExpression
src/services/auth/Auth.tsx:56:7
 export const RequireAuth = ({ children }: { children: JSX.Element }) => {
   const { user } = useAuth();
   //const location = useLocation();
-  if (!user) {
+  if (true) {
     // return <Navigate to="/login" replace state={{ path: location.pathname }} />;
     return (

[Timeout] BlockStatement
src/services/auth/Auth.tsx:56:14
 export const RequireAuth = ({ children }: { children: JSX.Element }) => {
   const { user } = useAuth();
   //const location = useLocation();
-  if (!user) {
-    // return <Navigate to="/login" replace state={{ path: location.pathname }} />;
-    return (
-      <Link href="/" replace>
-        <SignIn />
-      </Link>
-    );
-  }
+  if (!user) {}
   return children;
 };
