[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:19:30
   // Right Cell Column
   const rc: number = col === state[row].length - 1 ? 0 : col + 1;
   // Down Cell Row
-  const dr: number = row === state.length - 1 ? 0 : row + 1;
+  const dr: number = row === state.length + 1 ? 0 : row + 1;
   // Down Cell Column
   const dc: number = col;
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:75:42
     (_, index) => state[index].slice()
   );
 
-  for (let i = 0; i < state.length; i++) {
-    for (let j = 0; j < state[i].length; j++) {
-      const locality = CalcLocality(state, i, j);
-      if (state[i][j] === 0) {
-        if (automaton.born[locality] === 1) {
-          newState[i][j] = 1;
-        }
-      } else {
-        if (automaton.save[locality] === 1) {
-          newState[i][j] = state[i][j] + 1;
-        } else {
-          newState[i][j] = 0;
-        }
-      }
-    }
-  }
+  for (let i = 0; i < state.length; i++) {}
   return newState;
 };
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:76:47
   );
 
   for (let i = 0; i < state.length; i++) {
-    for (let j = 0; j < state[i].length; j++) {
-      const locality = CalcLocality(state, i, j);
-      if (state[i][j] === 0) {
-        if (automaton.born[locality] === 1) {
-          newState[i][j] = 1;
-        }
-      } else {
-        if (automaton.save[locality] === 1) {
-          newState[i][j] = state[i][j] + 1;
-        } else {
-          newState[i][j] = 0;
-        }
-      }
-    }
+    for (let j = 0; j < state[i].length; j++) {}
   }
   return newState;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:117:36
       ),
     ];
   }
-  return data.filter((_, index) => index < size);
+  return data.filter((_, index) => index >= size);
 };
 export const ClearState = (data: number[][]): number[][] => {
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0
