[NoCoverage] BlockStatement
src/pages/main/Main.tsx:15:78
 };
 
 const Main = ({ mode, probe, onModeChange }: MainProps) => {
-  const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {
-    onModeChange(event.currentTarget.value as AppStoreMode);
-  };
+  const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {};
 
   return (
