[Survived] ConditionalExpression
main/components/effects/MainEffects.tsx:210:21
         <div>
           <Button
             onAction={mute}
-            status={status === "stopped"}
+            status={true}
             caption="Остановить"
             testId="actionstop"
