[Survived] StringLiteral
src/store/ducks/state.ts:18:28
 import { actionSetStatus } from "./status";
 import { actionSetVelocity } from "./velocity";
 
-const STATE_SAVE_CONFIRM = "cellular-automaton/state/save/confirm";
+const STATE_SAVE_CONFIRM = "";
 const STATE_SAVE_REJECT = "cellular-automaton/state/save/failed";
 const STATE_LOAD_CONFIRM = "cellular-automaton/state/load/confirm";

[Survived] StringLiteral
src/store/ducks/state.ts:19:27
 import { actionSetVelocity } from "./velocity";
 
 const STATE_SAVE_CONFIRM = "cellular-automaton/state/save/confirm";
-const STATE_SAVE_REJECT = "cellular-automaton/state/save/failed";
+const STATE_SAVE_REJECT = "";
 const STATE_LOAD_CONFIRM = "cellular-automaton/state/load/confirm";
 const STATE_LOAD_REJECT = "cellular-automaton/state/load/failed";

[Survived] StringLiteral
src/store/ducks/state.ts:20:28
 
 const STATE_SAVE_CONFIRM = "cellular-automaton/state/save/confirm";
 const STATE_SAVE_REJECT = "cellular-automaton/state/save/failed";
-const STATE_LOAD_CONFIRM = "cellular-automaton/state/load/confirm";
+const STATE_LOAD_CONFIRM = "";
 const STATE_LOAD_REJECT = "cellular-automaton/state/load/failed";
 export const STATE_LOAD_UNKNOWN = "cellular-automaton/state/unknown";

[Survived] StringLiteral
src/store/ducks/state.ts:22:35
 const STATE_SAVE_REJECT = "cellular-automaton/state/save/failed";
 const STATE_LOAD_CONFIRM = "cellular-automaton/state/load/confirm";
 const STATE_LOAD_REJECT = "cellular-automaton/state/load/failed";
-export const STATE_LOAD_UNKNOWN = "cellular-automaton/state/unknown";
+export const STATE_LOAD_UNKNOWN = "";
 
 export type State = {

[Survived] StringLiteral
src/store/ducks/state.ts:52:38
   | ActionLoadStateReject
   | ActionUnknown;
 
-export const initialState = { error: "" };
+export const initialState = { error: "Stryker was here!" };
 
 export default function reducer(state: State = initialState, action: Action) {

[Killed] StringLiteral
src/store/ducks/state.ts:59:16
     case STATE_SAVE_CONFIRM:
       return {
         ...state,
-        error: "",
+        error: "Stryker was here!",
       };
     case STATE_SAVE_REJECT:
killedBy: State reducer save confirm
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "",
+   "error": "Stryker was here!",

[NoCoverage] BlockStatement
src/store/ducks/state.ts:88:6
     ActionSaveStateConfim | ActionSaveStateReject
   >,
   getState: () => AppReduxState
-) => {
-  try {
-    await localStorage.setItem(
-      "cellular-automaton.state",
-      JSON.stringify(getState())
-    );
-    dispatch(actionSaveStateConfirm());
-  } catch (e: unknown) {
-    dispatch(
-      actionSaveStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
-};
+) => {};
 export const thunkLoadState = async (
   dispatch: ThunkDispatch<

[NoCoverage] BlockStatement
src/store/ducks/state.ts:89:7
   >,
   getState: () => AppReduxState
 ) => {
-  try {
-    await localStorage.setItem(
-      "cellular-automaton.state",
-      JSON.stringify(getState())
-    );
-    dispatch(actionSaveStateConfirm());
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     dispatch(
       actionSaveStateReject(

[NoCoverage] StringLiteral
src/store/ducks/state.ts:91:7
 ) => {
   try {
     await localStorage.setItem(
-      "cellular-automaton.state",
+      "",
       JSON.stringify(getState())
     );

[NoCoverage] BlockStatement
src/store/ducks/state.ts:118:6
     | ActionStatus
     | ActionVelocity
   >
-) => {
-  try {
-    const state = JSON.parse(
-      (await localStorage.getItem("cellular-automaton.state")) || ""
-    );
-    dispatch(actionLoadStateConfirm());
-    if (!!state) {
-      dispatch(actionSetStatus("stopped"));
-      dispatch(actionSetAutomaton(state.automaton.value));
-      dispatch(actionResetEpoch());
-      dispatch(actionSetFactor(state.factor.value));
-      dispatch(actionSetVelocity(state.velocity.value));
-      dispatch(actionSetSizeX(state.gameLife.data[0].length));
-      dispatch(actionSetSizeY(state.gameLife.data.length));
-      dispatch(actionLoadField(state.gameLife.data));
-    }
-  } catch (e: unknown) {
-    dispatch(
-      actionLoadStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
-};
+) => {};
 
 export const actionSaveState = () => thunkSaveState;

[NoCoverage] BlockStatement
src/store/ducks/state.ts:119:7
     | ActionVelocity
   >
 ) => {
-  try {
-    const state = JSON.parse(
-      (await localStorage.getItem("cellular-automaton.state")) || ""
-    );
-    dispatch(actionLoadStateConfirm());
-    if (!!state) {
-      dispatch(actionSetStatus("stopped"));
-      dispatch(actionSetAutomaton(state.automaton.value));
-      dispatch(actionResetEpoch());
-      dispatch(actionSetFactor(state.factor.value));
-      dispatch(actionSetVelocity(state.velocity.value));
-      dispatch(actionSetSizeX(state.gameLife.data[0].length));
-      dispatch(actionSetSizeY(state.gameLife.data.length));
-      dispatch(actionLoadField(state.gameLife.data));
-    }
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     dispatch(
       actionLoadStateReject(

[NoCoverage] StringLiteral
src/store/ducks/state.ts:121:35
 ) => {
   try {
     const state = JSON.parse(
-      (await localStorage.getItem("cellular-automaton.state")) || ""
+      (await localStorage.getItem("")) || ""
     );
     dispatch(actionLoadStateConfirm());
