[NoCoverage] StringLiteral
EDUCATION/cellular-automaton/src/App.tsx:15:62
 
 const App = () => {
   const [user] = React.useState(
-    () => localStorage.getItem("cellular-automaton.user") || ""
+    () => localStorage.getItem("cellular-automaton.user") || "Stryker was here!"
   );
   const [mode, setMode] = React.useState<AppStoreMode>("Native");

[NoCoverage] BlockStatement
EDUCATION/cellular-automaton/src/App.tsx:19:19
   );
   const [mode, setMode] = React.useState<AppStoreMode>("Native");
 
-  useEffect(() => {
-    localStorage.setItem("cellular-automaton.user", user);
-  }, [user, mode]);
+  useEffect(() => {}, [user, mode]);
   const onModeChange = (storeMode: AppStoreMode) => {
     setMode(storeMode as AppStoreMode);

[NoCoverage] BlockStatement
EDUCATION/cellular-automaton/src/App.tsx:22:53
   useEffect(() => {
     localStorage.setItem("cellular-automaton.user", user);
   }, [user, mode]);
-  const onModeChange = (storeMode: AppStoreMode) => {
-    setMode(storeMode as AppStoreMode);
-  };
+  const onModeChange = (storeMode: AppStoreMode) => {};
 
   return (
