[Timeout] BlockStatement
src/components/automaton/Automaton.tsx:12:67
   defAutomaton,
   onAutomatonChange,
 }: Props) => {
-  const onChange = (event: React.FormEvent<HTMLSelectElement>) => {
-    event.preventDefault();
-    onAutomatonChange(
-      AutomatonsList.filter(
-        (automaton) => automaton.id === parseInt(event.currentTarget.value)
-      )[0]
-    );
-  };
+  const onChange = (event: React.FormEvent<HTMLSelectElement>) => {};
   return (
     <select

[Killed] ConditionalExpression
src/components/automaton/Automaton.tsx:16:24
     event.preventDefault();
     onAutomatonChange(
       AutomatonsList.filter(
-        (automaton) => automaton.id === parseInt(event.currentTarget.value)
+        (automaton) => false
       )[0]
     );
killedBy: MainRedux should Set Automaton
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/components/automaton/Automaton.tsx:16:24
     event.preventDefault();
     onAutomatonChange(
       AutomatonsList.filter(
-        (automaton) => automaton.id === parseInt(event.currentTarget.value)
+        (automaton) => automaton.id !== parseInt(event.currentTarget.value)
       )[0]
     );
killedBy: MainRedux should Set Automaton
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 25

[Timeout] StringLiteral
src/components/automaton/Automaton.tsx:22:25
   };
   return (
     <select
-      className={styles["automaton"]}
+      className={styles[""]}
       data-testid="automaton"
       onChange={onChange}

[Timeout] ConditionalExpression
src/components/automaton/Automaton.tsx:28:13
       defaultValue={defAutomaton}
     >
       {AutomatonsList.sort((a, b) => {
-        if (a.name < b.name) return -1;
+        if (false) return -1;
         if (a.name > b.name) return 1;
         return 0;

[Timeout] EqualityOperator
src/components/automaton/Automaton.tsx:28:13
       defaultValue={defAutomaton}
     >
       {AutomatonsList.sort((a, b) => {
-        if (a.name < b.name) return -1;
+        if (a.name <= b.name) return -1;
         if (a.name > b.name) return 1;
         return 0;

[Timeout] EqualityOperator
src/components/automaton/Automaton.tsx:29:13
     >
       {AutomatonsList.sort((a, b) => {
         if (a.name < b.name) return -1;
-        if (a.name > b.name) return 1;
+        if (a.name <= b.name) return 1;
         return 0;
       }).map((automaton) => (

[Timeout] EqualityOperator
src/components/automaton/Automaton.tsx:29:13
     >
       {AutomatonsList.sort((a, b) => {
         if (a.name < b.name) return -1;
-        if (a.name > b.name) return 1;
+        if (a.name >= b.name) return 1;
         return 0;
       }).map((automaton) => (

[Timeout] ArrowFunction
src/components/automaton/Automaton.tsx:31:14
         if (a.name < b.name) return -1;
         if (a.name > b.name) return 1;
         return 0;
-      }).map((automaton) => (
-        <option key={automaton.id} value={automaton.id}>
-          {automaton.name}
-        </option>
-      ))}
+      }).map(() => undefined)}
     </select>
   );
