[Timeout] StringLiteral
src/components/automaton/types.tsx:73:11
   },
   {
     id: 7,
-    name: "Репликатор (B13456/S01356)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 1, 0, 1, 1, 1, 1, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:108:11
   },
   {
     id: 12,
-    name: "Вольфрама-Паккарда (B257/S27)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 1, 0, 0, 1, 0, 1, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:115:11
   },
   {
     id: 13,
-    name: "Бессмертная жизнь (B3/S012345678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:122:11
   },
   {
     id: 14,
-    name: "Maze (B3/S12345)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:129:11
   },
   {
     id: 15,
-    name: "Жизнь (B3/S23)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:136:11
   },
   {
     id: 16,
-    name: "Автомат Вольфрама-Паккарда, класс 2 (B3/S234)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:143:11
   },
   {
     id: 17,
-    name: "Коралл (B3/S45678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:164:11
   },
   {
     id: 20,
-    name: "Ассимиляция (B345/S4567)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 1, 1, 0, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:185:11
   },
   {
     id: 23,
-    name: "Амёба (B357/S1358)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 1, 0, 1, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:192:11
   },
   {
     id: 24,
-    name: "Псевдожизнь (B357/S238)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 1, 0, 1, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:206:11
   },
   {
     id: 26,
-    name: "Гламурная жизнь (B36/S23)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 1, 0, 0],

[Timeout] StringLiteral
src/components/automaton/types.tsx:220:11
   },
   {
     id: 28,
-    name: "Stains (B3678/S235678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 1, 1, 1],

[Timeout] StringLiteral
src/components/automaton/types.tsx:227:11
   },
   {
     id: 29,
-    name: "День и Ночь (B3678/S34678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 1, 1, 1],

[Timeout] StringLiteral
src/components/automaton/types.tsx:241:11
   },
   {
     id: 31,
-    name: "Автомат Вольфрама-Паккарда (B378/S012345678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 1, 1],

[Timeout] StringLiteral
src/components/automaton/types.tsx:248:11
   },
   {
     id: 32,
-    name: "Коагуляция (B378/S235678)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 1, 0, 0, 0, 1, 1],

[Timeout] StringLiteral
src/components/automaton/types.tsx:255:11
   },
   {
     id: 33,
-    name: "Города за стенами (B45678/S2345)",
+    name: "",
     //     0  1  2  3  4  5  6  7  8
     born: [0, 0, 0, 0, 1, 1, 1, 1, 1],
