[Killed] BlockStatement
src/components/button/Button.tsx:14:66
   caption,
   testId,
 }: Props) => {
-  const onClick = (event: React.FormEvent<HTMLButtonElement>) => {
-    event.preventDefault();
-    onAction();
-  };
+  const onClick = (event: React.FormEvent<HTMLButtonElement>) => {};
   return (
     <button
killedBy: MainRedux should Run automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] ArrayDeclaration
src/components/button/Button.tsx:21:18
   return (
     <button
       data-testid={testId}
-      className={[
-        styles["button"],
-        status ? styles["control-active"] : styles["control-inactive"],
-      ].join(" ")}
+      className={[].join(" ")}
       onClick={onClick}
     >
