[Timeout] StringLiteral
src/components/cell/Cell.tsx:12:19
 export const calcCellColor: CalcColor = (
   generation: number,
   colorScaleMin = "yellow",
-  colorScaleMax = "darkgreen"
+  colorScaleMax = ""
 ) =>
   chroma

[Timeout] ArithmeticOperator
src/components/cell/Cell.tsx:15:44
   colorScaleMax = "darkgreen"
 ) =>
   chroma
-    .scale([colorScaleMin, colorScaleMax])((generation - 1) * 0.1)
+    .scale([colorScaleMin, colorScaleMax])((generation - 1) / 0.1)
     .hex();
 

[Timeout] ArithmeticOperator
src/components/cell/Cell.tsx:15:45
   colorScaleMax = "darkgreen"
 ) =>
   chroma
-    .scale([colorScaleMin, colorScaleMax])((generation - 1) * 0.1)
+    .scale([colorScaleMin, colorScaleMax])((generation + 1) * 0.1)
     .hex();
 

[Killed] BlockStatement
src/components/cell/Cell.tsx:34:71
     colorEmpty,
     colorCell,
   };
-  const onClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
-    event.preventDefault();
-    onClick(cellParams);
-  };
+  const onClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {};
   const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
killedBy: MainRedux should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/cell/Cell.tsx:38:75
     event.preventDefault();
     onClick(cellParams);
   };
-  const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
-    event.preventDefault();
-    event.buttons === 1 && onClick(cellParams);
-    event.buttons === 1 && probe && probe(cellParams);
-  };
+  const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {};
   const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
killedBy: Cell mouse over event with pressed button
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/components/cell/Cell.tsx:40:5
   };
   const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
-    event.buttons === 1 && onClick(cellParams);
+    false;
     event.buttons === 1 && probe && probe(cellParams);
   };

[Survived] ConditionalExpression
src/components/cell/Cell.tsx:40:5
   };
   const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
-    event.buttons === 1 && onClick(cellParams);
+    true;
     event.buttons === 1 && probe && probe(cellParams);
   };

[Killed] EqualityOperator
src/components/cell/Cell.tsx:41:5
   const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
     event.buttons === 1 && onClick(cellParams);
-    event.buttons === 1 && probe && probe(cellParams);
+    event.buttons !== 1 && probe && probe(cellParams);
   };
   const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
killedBy: Cell mouse over event with pressed button
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/cell/Cell.tsx:41:5
   const onMouseOverHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
     event.buttons === 1 && onClick(cellParams);
-    event.buttons === 1 && probe && probe(cellParams);
+    false;
   };
   const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
killedBy: Cell mouse over event with pressed button
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/cell/Cell.tsx:43:77
     event.buttons === 1 && onClick(cellParams);
     event.buttons === 1 && probe && probe(cellParams);
   };
-  const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
-    event.preventDefault();
-    probe && probe(cellParams);
-  };
+  const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {};
   return (
     <div
killedBy: Cell mouse double click event
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/cell/Cell.tsx:45:5
   };
   const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
-    probe && probe(cellParams);
+    false;
   };
   return (
killedBy: Cell mouse double click event
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/cell/Cell.tsx:45:5
   };
   const onDoubleClickHandler = (event: React.MouseEvent<HTMLDivElement>) => {
     event.preventDefault();
-    probe && probe(cellParams);
+    true;
   };
   return (
killedBy: Cell mouse double click event
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] ConditionalExpression
src/components/cell/Cell.tsx:55:28
       onClick={onClickHandler}
       onDoubleClick={onDoubleClickHandler}
       onMouseOver={onMouseOverHandler}
-      style={{ background: generation === 0 ? colorEmpty : colorCell }}
+      style={{ background: false ? colorEmpty : colorCell }}
     ></div>
   );

[Timeout] EqualityOperator
src/components/cell/Cell.tsx:55:28
       onClick={onClickHandler}
       onDoubleClick={onDoubleClickHandler}
       onMouseOver={onMouseOverHandler}
-      style={{ background: generation === 0 ? colorEmpty : colorCell }}
+      style={{ background: generation !== 0 ? colorEmpty : colorCell }}
     ></div>
   );
