[Killed] BlockStatement
src/components/panel/Panel.tsx:11:47
 import { Plate } from "./components/plate/Plate";
 
 export const Panel: FC<Props> = ({ data, onChange }: Props) => {
-  const cellOnClick = (params: CellParams) => {
-    onChange(params);
-  };
+  const cellOnClick = (params: CellParams) => {};
   return (
     <Plate>
killedBy: MainRedux should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/panel/Panel.tsx:16:36
   };
   return (
     <Plate>
-      {data.map((row, rowindex) => {
-        return (
-          <Row row={rowindex} key={`R:${rowindex}`}>
-            {row.map((item, colindex) => (
-              <Nest
-                row={rowindex}
-                col={colindex}
-                key={`R:${rowindex}C:${colindex}`}
-              >
-                <Cell
-                  data-testid={`R${rowindex}:C${colindex}`}
-                  row={rowindex}
-                  col={colindex}
-                  generation={item}
-                  onClick={cellOnClick}
-                  colorEmpty={EMPTY_CELL_COLOR}
-                ></Cell>
-              </Nest>
-            ))}
-          </Row>
-        );
-      })}
+      {data.map((row, rowindex) => {})}
     </Plate>
   );
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 25201
+ Received  +     0

@@ -352,25210 +352,9 @@

[Timeout] StringLiteral
src/components/panel/Panel.tsx:18:36
     <Plate>
       {data.map((row, rowindex) => {
         return (
-          <Row row={rowindex} key={`R:${rowindex}`}>
+          <Row row={rowindex} key={``}>
             {row.map((item, colindex) => (
               <Nest

[Killed] ArrowFunction
src/components/panel/Panel.tsx:19:22
       {data.map((row, rowindex) => {
         return (
           <Row row={rowindex} key={`R:${rowindex}`}>
-            {row.map((item, colindex) => (
-              <Nest
-                row={rowindex}
-                col={colindex}
-                key={`R:${rowindex}C:${colindex}`}
-              >
-                <Cell
-                  data-testid={`R${rowindex}:C${colindex}`}
-                  row={rowindex}
-                  col={colindex}
-                  generation={item}
-                  onClick={cellOnClick}
-                  colorEmpty={EMPTY_CELL_COLOR}
-                ></Cell>
-              </Nest>
-            ))}
+            {row.map(() => undefined)}
           </Row>
         );
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 25050
+ Received  +     0

@@ -355,25207 +355,157 @@
