[Timeout] StringLiteral
panel/components/nest/Nest.tsx:12:62
   return (
     <div
       key={`Wrap:R${row}:C${col}`}
-      className={[styles["grid"], styles["grid--cell"]].join(" ")}
+      className={[styles["grid"], styles["grid--cell"]].join("")}
       data-testid="Panel"
     >
