[Killed] BlockStatement
src/components/size/Size.tsx:16:66
   testId,
 }: Props) => {
   const [size, setSize] = useState(defSize);
-  const onChange = (event: React.FormEvent<HTMLInputElement>) => {
-    event.preventDefault();
-    const currentSize: number = parseInt(event.currentTarget.value);
-    if (currentSize < minSize) {
-      setSize(minSize);
-      onSizeChange(minSize);
-    } else {
-      if (currentSize > maxSize) {
-        setSize(maxSize);
-        onSizeChange(maxSize);
-      } else {
-        onSizeChange(currentSize);
-        setSize(currentSize);
-      }
-    }
-  };
+  const onChange = (event: React.FormEvent<HTMLInputElement>) => {};
   return (
     <input
killedBy: Main should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/size/Size.tsx:19:9
   const onChange = (event: React.FormEvent<HTMLInputElement>) => {
     event.preventDefault();
     const currentSize: number = parseInt(event.currentTarget.value);
-    if (currentSize < minSize) {
+    if (false) {
       setSize(minSize);
       onSizeChange(minSize);
killedBy: Control Size check min boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 9

[Killed] ConditionalExpression
src/components/size/Size.tsx:19:9
   const onChange = (event: React.FormEvent<HTMLInputElement>) => {
     event.preventDefault();
     const currentSize: number = parseInt(event.currentTarget.value);
-    if (currentSize < minSize) {
+    if (true) {
       setSize(minSize);
       onSizeChange(minSize);
killedBy: Main should change X size
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 51
Received: 10

[Killed] BlockStatement
src/components/size/Size.tsx:22:12
     if (currentSize < minSize) {
       setSize(minSize);
       onSizeChange(minSize);
-    } else {
-      if (currentSize > maxSize) {
-        setSize(maxSize);
-        onSizeChange(maxSize);
-      } else {
-        onSizeChange(currentSize);
-        setSize(currentSize);
-      }
-    }
+    } else {}
   };
   return (
killedBy: Main should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/size/Size.tsx:23:11
       setSize(minSize);
       onSizeChange(minSize);
     } else {
-      if (currentSize > maxSize) {
+      if (false) {
         setSize(maxSize);
         onSizeChange(maxSize);
killedBy: Control Size check max boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 50
Received: 51

[Killed] ConditionalExpression
src/components/size/Size.tsx:23:11
       setSize(minSize);
       onSizeChange(minSize);
     } else {
-      if (currentSize > maxSize) {
+      if (true) {
         setSize(maxSize);
         onSizeChange(maxSize);
killedBy: MainEffects should change X size
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 51
Received: 100

[Killed] BlockStatement
src/components/size/Size.tsx:26:14
       if (currentSize > maxSize) {
         setSize(maxSize);
         onSizeChange(maxSize);
-      } else {
-        onSizeChange(currentSize);
-        setSize(currentSize);
-      }
+      } else {}
     }
   };
killedBy: Main should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0
