[Killed] BlockStatement
src/components/velocity/Velocity.tsx:12:67
   onVelocityChange,
   defVelocity,
 }: Props) => {
-  const onChange = (event: React.FormEvent<HTMLSelectElement>) => {
-    event.preventDefault();
-    onVelocityChange(parseInt(event.currentTarget.value));
-  };
+  const onChange = (event: React.FormEvent<HTMLSelectElement>) => {};
   return (
     <select
killedBy: MainRedux should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] UnaryOperator
src/components/velocity/Velocity.tsx:24:39
       defaultValue={defVelocity}
     >
       {VelocitySet.sort((a, b) => {
-        if (a.delay < b.delay) return -1;
+        if (a.delay < b.delay) return +1;
         if (a.delay > b.delay) return 1;
         return 0;
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 11
+ Received  + 11

@@ -258,34 +258,34 @@

[Timeout] ConditionalExpression
src/components/velocity/Velocity.tsx:24:13
       defaultValue={defVelocity}
     >
       {VelocitySet.sort((a, b) => {
-        if (a.delay < b.delay) return -1;
+        if (false) return -1;
         if (a.delay > b.delay) return 1;
         return 0;

[Timeout] ConditionalExpression
src/components/velocity/Velocity.tsx:25:13
     >
       {VelocitySet.sort((a, b) => {
         if (a.delay < b.delay) return -1;
-        if (a.delay > b.delay) return 1;
+        if (true) return 1;
         return 0;
       }).map((item, index) => {

[Timeout] EqualityOperator
src/components/velocity/Velocity.tsx:25:13
     >
       {VelocitySet.sort((a, b) => {
         if (a.delay < b.delay) return -1;
-        if (a.delay > b.delay) return 1;
+        if (a.delay >= b.delay) return 1;
         return 0;
       }).map((item, index) => {

[Timeout] BlockStatement
src/components/velocity/Velocity.tsx:27:31
         if (a.delay < b.delay) return -1;
         if (a.delay > b.delay) return 1;
         return 0;
-      }).map((item, index) => {
-        return (
-          <option key={index} value={item.delay}>
-            {item.name}
-          </option>
-        );
-      })}
+      }).map((item, index) => {})}
     </select>
   );
