[Killed] StringLiteral
src/components/velocity/types.ts:14:24
 
 export const VelocitySet: VelocityItem[] = [
   { delay: 1000, name: "Медленно" },
-  { delay: 2000, name: "Очень медленно" },
+  { delay: 2000, name: "" },
   { delay: 100, name: "Быстро" },
   { delay: 10, name: "Очень быстро" },
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 3
+ Received  + 1

@@ -280,13 +280,11 @@
