[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:11:53
   col: number
 ): LocalityIndexes => {
   // Upper Cell Row
-  const ur: number = row === 0 ? state.length - 1 : row - 1;
+  const ur: number = row === 0 ? state.length - 1 : row + 1;
   // Upper Cell Column
   const uc: number = col;
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:11:22
   col: number
 ): LocalityIndexes => {
   // Upper Cell Row
-  const ur: number = row === 0 ? state.length - 1 : row - 1;
+  const ur: number = row !== 0 ? state.length - 1 : row - 1;
   // Upper Cell Column
   const uc: number = col;
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:17:22
   // Right Cell Row
   const rr: number = row;
   // Right Cell Column
-  const rc: number = col === state[row].length - 1 ? 0 : col + 1;
+  const rc: number = false ? 0 : col + 1;
   // Down Cell Row
   const dr: number = row === state.length - 1 ? 0 : row + 1;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:17:22
   // Right Cell Row
   const rr: number = row;
   // Right Cell Column
-  const rc: number = col === state[row].length - 1 ? 0 : col + 1;
+  const rc: number = true ? 0 : col + 1;
   // Down Cell Row
   const dr: number = row === state.length - 1 ? 0 : row + 1;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:19:22
   // Right Cell Column
   const rc: number = col === state[row].length - 1 ? 0 : col + 1;
   // Down Cell Row
-  const dr: number = row === state.length - 1 ? 0 : row + 1;
+  const dr: number = false ? 0 : row + 1;
   // Down Cell Column
   const dc: number = col;
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:19:22
   // Right Cell Column
   const rc: number = col === state[row].length - 1 ? 0 : col + 1;
   // Down Cell Row
-  const dr: number = row === state.length - 1 ? 0 : row + 1;
+  const dr: number = row !== state.length - 1 ? 0 : row + 1;
   // Down Cell Column
   const dc: number = col;
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:25:22
   // Left Cell Row
   const lr: number = row;
   // Left Cell Column
-  const lc: number = col === 0 ? state[row].length - 1 : col - 1;
+  const lc: number = false ? state[row].length - 1 : col - 1;
 
   return {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:25:58
   // Left Cell Row
   const lr: number = row;
   // Left Cell Column
-  const lc: number = col === 0 ? state[row].length - 1 : col - 1;
+  const lc: number = col === 0 ? state[row].length - 1 : col + 1;
 
   return {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:46:7
 ): number => {
   const indexes = CalcIndexes(state, row, col);
 
-  if (localityType === "Moore") {
+  if (true) {
     return [
       state[indexes.ur][indexes.uc],
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:46:7
 ): number => {
   const indexes = CalcIndexes(state, row, col);
 
-  if (localityType === "Moore") {
+  if (localityType !== "Moore") {
     return [
       state[indexes.ur][indexes.uc],
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:57:36
       state[indexes.ur][indexes.rc],
       state[indexes.dr][indexes.rc],
       state[indexes.dr][indexes.lc],
-    ].reduce((acc, item) => acc + (item === 0 ? 0 : 1), 0);
+    ].reduce((acc, item) => acc + (item !== 0 ? 0 : 1), 0);
   }
   return [
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:57:29
       state[indexes.ur][indexes.rc],
       state[indexes.dr][indexes.rc],
       state[indexes.dr][indexes.lc],
-    ].reduce((acc, item) => acc + (item === 0 ? 0 : 1), 0);
+    ].reduce((acc, item) => acc - (item === 0 ? 0 : 1), 0);
   }
   return [
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:64:34
     state[indexes.rr][indexes.rc],
     state[indexes.dr][indexes.dc],
     state[indexes.lr][indexes.lc],
-  ].reduce((acc, item) => acc + (item === 0 ? 0 : 1), 0);
+  ].reduce((acc, item) => acc + (true ? 0 : 1), 0);
 };
 export const CalcState = (
killedBy: Calc cell locality Neumann 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:64:27
     state[indexes.rr][indexes.rc],
     state[indexes.dr][indexes.dc],
     state[indexes.lr][indexes.lc],
-  ].reduce((acc, item) => acc + (item === 0 ? 0 : 1), 0);
+  ].reduce((acc, item) => acc - (item === 0 ? 0 : 1), 0);
 };
 export const CalcState = (
killedBy: Calc cell locality Neumann 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: -4

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:75:19
     (_, index) => state[index].slice()
   );
 
-  for (let i = 0; i < state.length; i++) {
+  for (let i = 0; i >= state.length; i++) {
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] UpdateOperator
cellular-automaton/src/domain/engine.tsx:75:37
     (_, index) => state[index].slice()
   );
 
-  for (let i = 0; i < state.length; i++) {
+  for (let i = 0; i < state.length; i--) {
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:76:21
   );
 
   for (let i = 0; i < state.length; i++) {
-    for (let j = 0; j < state[i].length; j++) {
+    for (let j = 0; j <= state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
       if (state[i][j] === 0) {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Timeout] EqualityOperator
cellular-automaton/src/domain/engine.tsx:76:21
   );
 
   for (let i = 0; i < state.length; i++) {
-    for (let j = 0; j < state[i].length; j++) {
+    for (let j = 0; j >= state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
       if (state[i][j] === 0) {

[Timeout] EqualityOperator
cellular-automaton/src/domain/engine.tsx:78:11
   for (let i = 0; i < state.length; i++) {
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
-      if (state[i][j] === 0) {
+      if (state[i][j] !== 0) {
         if (automaton.born[locality] === 1) {
           newState[i][j] = 1;

[Timeout] BlockStatement
cellular-automaton/src/domain/engine.tsx:78:30
   for (let i = 0; i < state.length; i++) {
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
-      if (state[i][j] === 0) {
-        if (automaton.born[locality] === 1) {
-          newState[i][j] = 1;
-        }
-      } else {
+      if (state[i][j] === 0) {} else {
         if (automaton.save[locality] === 1) {
           newState[i][j] = state[i][j] + 1;

[Timeout] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:79:13
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
       if (state[i][j] === 0) {
-        if (automaton.born[locality] === 1) {
+        if (false) {
           newState[i][j] = 1;
         }

[Timeout] EqualityOperator
cellular-automaton/src/domain/engine.tsx:79:13
     for (let j = 0; j < state[i].length; j++) {
       const locality = CalcLocality(state, i, j);
       if (state[i][j] === 0) {
-        if (automaton.born[locality] === 1) {
+        if (automaton.born[locality] !== 1) {
           newState[i][j] = 1;
         }

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:82:14
         if (automaton.born[locality] === 1) {
           newState[i][j] = 1;
         }
-      } else {
-        if (automaton.save[locality] === 1) {
-          newState[i][j] = state[i][j] + 1;
-        } else {
-          newState[i][j] = 0;
-        }
-      }
+      } else {}
     }
   }
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:83:13
           newState[i][j] = 1;
         }
       } else {
-        if (automaton.save[locality] === 1) {
+        if (true) {
           newState[i][j] = state[i][j] + 1;
         } else {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:83:13
           newState[i][j] = 1;
         }
       } else {
-        if (automaton.save[locality] === 1) {
+        if (automaton.save[locality] !== 1) {
           newState[i][j] = state[i][j] + 1;
         } else {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:84:28
         }
       } else {
         if (automaton.save[locality] === 1) {
-          newState[i][j] = state[i][j] + 1;
+          newState[i][j] = state[i][j] - 1;
         } else {
           newState[i][j] = 0;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:85:16
       } else {
         if (automaton.save[locality] === 1) {
           newState[i][j] = state[i][j] + 1;
-        } else {
-          newState[i][j] = 0;
-        }
+        } else {}
       }
     }
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:94:7
   return newState;
 };
 export const setXSize = (data: number[][], size: number): number[][] => {
-  if (size < MIN_COLS) {
+  if (true) {
     return data.map((row) => row.slice());
   }
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 51
Received: 50

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:94:24
   return newState;
 };
 export const setXSize = (data: number[][], size: number): number[][] => {
-  if (size < MIN_COLS) {
-    return data.map((row) => row.slice());
-  }
+  if (size < MIN_COLS) {}
   if (size > data[0].length) {
     return data.map((row) => [
killedBy: X Size changing low limit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:97:30
   if (size < MIN_COLS) {
     return data.map((row) => row.slice());
   }
-  if (size > data[0].length) {
-    return data.map((row) => [
-      ...row,
-      ...Array.from({ length: size - data[0].length }, () => 0),
-    ]);
-  }
+  if (size > data[0].length) {}
   return data.map((row) => row.filter((_, index) => index < size));
 };
killedBy: X Size changing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 10

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:97:7
   if (size < MIN_COLS) {
     return data.map((row) => row.slice());
   }
-  if (size > data[0].length) {
+  if (size <= data[0].length) {
     return data.map((row) => [
       ...row,
killedBy: X Size changing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 10

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:100:31
   if (size > data[0].length) {
     return data.map((row) => [
       ...row,
-      ...Array.from({ length: size - data[0].length }, () => 0),
+      ...Array.from({ length: size + data[0].length }, () => 0),
     ]);
   }
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 51
Received: 151

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:103:53
       ...Array.from({ length: size - data[0].length }, () => 0),
     ]);
   }
-  return data.map((row) => row.filter((_, index) => index < size));
+  return data.map((row) => row.filter((_, index) => false));
 };
 export const setYSize = (data: number[][], size: number): number[][] => {
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:103:53
       ...Array.from({ length: size - data[0].length }, () => 0),
     ]);
   }
-  return data.map((row) => row.filter((_, index) => index < size));
+  return data.map((row) => row.filter((_, index) => index >= size));
 };
 export const setYSize = (data: number[][], size: number): number[][] => {
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:106:7
   return data.map((row) => row.filter((_, index) => index < size));
 };
 export const setYSize = (data: number[][], size: number): number[][] => {
-  if (size < MIN_ROWS) {
+  if (size >= MIN_ROWS) {
     return data.map((row) => row.slice());
   }
killedBy: Y Size changing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 10

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:106:24
   return data.map((row) => row.filter((_, index) => index < size));
 };
 export const setYSize = (data: number[][], size: number): number[][] => {
-  if (size < MIN_ROWS) {
-    return data.map((row) => row.slice());
-  }
+  if (size < MIN_ROWS) {}
   if (size > data.length) {
     return [
killedBy: Y Size changing low limit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] BlockStatement
cellular-automaton/src/domain/engine.tsx:109:27
   if (size < MIN_ROWS) {
     return data.map((row) => row.slice());
   }
-  if (size > data.length) {
-    return [
-      ...data,
-      ...Array.from({ length: size - data.length }, () =>
-        Array.from({ length: data[0].length }, () => 0)
-      ),
-    ];
-  }
+  if (size > data.length) {}
   return data.filter((_, index) => index < size);
 };
killedBy: Y Size changing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 10

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:109:7
   if (size < MIN_ROWS) {
     return data.map((row) => row.slice());
   }
-  if (size > data.length) {
+  if (false) {
     return [
       ...data,
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 51
Received: 50

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:112:31
   if (size > data.length) {
     return [
       ...data,
-      ...Array.from({ length: size - data.length }, () =>
+      ...Array.from({ length: size + data.length }, () =>
         Array.from({ length: data[0].length }, () => 0)
       ),
killedBy: Y Size changing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 35

[Killed] ArrowFunction
cellular-automaton/src/domain/engine.tsx:117:22
       ),
     ];
   }
-  return data.filter((_, index) => index < size);
+  return data.filter(() => undefined);
 };
 export const ClearState = (data: number[][]): number[][] => {
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:117:36
       ),
     ];
   }
-  return data.filter((_, index) => index < size);
+  return data.filter((_, index) => false);
 };
 export const ClearState = (data: number[][]): number[][] => {
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:126:20
 };
 export const FillRandom = (data: number[][], factor: number): number[][] => {
   return data.map((row) =>
-    row.map(() => (100 * Math.random() > factor ? 0 : 1))
+    row.map(() => (100 / Math.random() > factor ? 0 : 1))
   );
 };
killedBy: Game Life reducer fill field
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
cellular-automaton/src/domain/engine.tsx:126:20
 };
 export const FillRandom = (data: number[][], factor: number): number[][] => {
   return data.map((row) =>
-    row.map(() => (100 * Math.random() > factor ? 0 : 1))
+    row.map(() => (true ? 0 : 1))
   );
 };
killedBy: Game Life reducer fill field
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:138:7
     ...data.slice(0, row),
     [
       ...data[row].slice(0, col),
-      data[row][col] > 0 ? 0 : 1,
+      data[row][col] <= 0 ? 0 : 1,
       ...data[row].slice(col + 1),
     ],
killedBy: Set Cell to 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] EqualityOperator
cellular-automaton/src/domain/engine.tsx:138:7
     ...data.slice(0, row),
     [
       ...data[row].slice(0, col),
-      data[row][col] > 0 ? 0 : 1,
+      data[row][col] >= 0 ? 0 : 1,
       ...data[row].slice(col + 1),
     ],
killedBy: Game Life reducer toggle cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:139:26
     [
       ...data[row].slice(0, col),
       data[row][col] > 0 ? 0 : 1,
-      ...data[row].slice(col + 1),
+      ...data[row].slice(col - 1),
     ],
     ...data.slice(row + 1),

[Survived] ArithmeticOperator
cellular-automaton/src/domain/engine.tsx:141:19
       data[row][col] > 0 ? 0 : 1,
       ...data[row].slice(col + 1),
     ],
-    ...data.slice(row + 1),
+    ...data.slice(row - 1),
   ];
 };
