[NoCoverage] StringLiteral
EDUCATION/cellular-automaton/src/index.tsx:5:50
 import ReactDOM from "react-dom";
 import App from "./App";
 
-ReactDOM.render(<App />, document.getElementById("root"));
+ReactDOM.render(<App />, document.getElementById(""));
 
