[NoCoverage] BlockStatement
cellular-automaton/src/pages/index.tsx:15:19
   useEffect(() => {
     localStorage.setItem("cellular-automaton.user", user);
   }, [user, mode]);
-  useEffect(() => {
-    setUser(localStorage.getItem("cellular-automaton.user") || "");
-  }, []);
+  useEffect(() => {}, []);
   const onModeChange = (storeMode: AppStoreMode) => {
     setMode(storeMode as AppStoreMode);

[NoCoverage] StringLiteral
cellular-automaton/src/pages/index.tsx:16:64
     localStorage.setItem("cellular-automaton.user", user);
   }, [user, mode]);
   useEffect(() => {
-    setUser(localStorage.getItem("cellular-automaton.user") || "");
+    setUser(localStorage.getItem("cellular-automaton.user") || "Stryker was here!");
   }, []);
   const onModeChange = (storeMode: AppStoreMode) => {

[NoCoverage] StringLiteral
cellular-automaton/src/pages/index.tsx:16:34
     localStorage.setItem("cellular-automaton.user", user);
   }, [user, mode]);
   useEffect(() => {
-    setUser(localStorage.getItem("cellular-automaton.user") || "");
+    setUser(localStorage.getItem("") || "");
   }, []);
   const onModeChange = (storeMode: AppStoreMode) => {

[NoCoverage] BlockStatement
cellular-automaton/src/pages/index.tsx:18:53
   useEffect(() => {
     setUser(localStorage.getItem("cellular-automaton.user") || "");
   }, []);
-  const onModeChange = (storeMode: AppStoreMode) => {
-    setMode(storeMode as AppStoreMode);
-  };
+  const onModeChange = (storeMode: AppStoreMode) => {};
   return (
     <StoreProvider mode={mode}>
