[Killed] BlockStatement
src/pages/main/Main.tsx:15:78
 };
 
 const Main = ({ mode, probe, onModeChange }: MainProps) => {
-  const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {
-    onModeChange(event.currentTarget.value as AppStoreMode);
-    !!probe && probe({});
-  };
+  const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {};
 
   return (
killedBy: Main Native change mode
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/pages/main/Main.tsx:17:5
 const Main = ({ mode, probe, onModeChange }: MainProps) => {
   const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {
     onModeChange(event.currentTarget.value as AppStoreMode);
-    !!probe && probe({});
+    true;
   };
 
killedBy: Main Native change mode
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/pages/main/Main.tsx:17:5
 const Main = ({ mode, probe, onModeChange }: MainProps) => {
   const onModeChangeHandler = (event: React.FormEvent<HTMLSelectElement>) => {
     onModeChange(event.currentTarget.value as AppStoreMode);
-    !!probe && probe({});
+    false;
   };
 
killedBy: Main Native change mode
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/pages/main/Main.tsx:24:11
     <>
       {(() => {
         switch (mode) {
-          case "Native":
-            return (
-              <MainNative probe={probe} onModeChange={onModeChangeHandler} />
-            );
+          case "Native":
           case "ReduxThunk":
             return (
killedBy: Main Native change mode
statusReason: Error: could not find react-redux context value; please ensure the component is wrapped in a <Provider>

[Survived] ConditionalExpression
src/pages/main/Main.tsx:28:11
             return (
               <MainNative probe={probe} onModeChange={onModeChangeHandler} />
             );
-          case "ReduxThunk":
-            return (
-              <MainRedux
-                probe={probe}
-                onModeChange={onModeChangeHandler}
-                useSaga={false}
-              />
-            );
+          case "ReduxThunk":
           case "ReduxSaga":
             return (

[Survived] BooleanLiteral
src/pages/main/Main.tsx:33:26
               <MainRedux
                 probe={probe}
                 onModeChange={onModeChangeHandler}
-                useSaga={false}
+                useSaga={true}
               />
             );

[Survived] ConditionalExpression
src/pages/main/Main.tsx:36:11
                 useSaga={false}
               />
             );
-          case "ReduxSaga":
-            return (
-              <MainRedux
-                probe={probe}
-                onModeChange={onModeChangeHandler}
-                useSaga
-              />
-            );
+          case "ReduxSaga":
           case "ReduxEffects":
             return (

[Survived] ConditionalExpression
src/pages/main/Main.tsx:44:11
                 useSaga
               />
             );
-          case "ReduxEffects":
-            return (
-              <MainEffects probe={probe} onModeChange={onModeChangeHandler} />
-            );
+          case "ReduxEffects":
           default:
             return (

[NoCoverage] ConditionalExpression
src/pages/main/Main.tsx:48:11
             return (
               <MainEffects probe={probe} onModeChange={onModeChangeHandler} />
             );
-          default:
-            return (
-              <MainNative probe={probe} onModeChange={onModeChangeHandler} />
-            );
+          default:
         }
       })()}
