[Timeout] BlockStatement
main/components/effects/MainEffects.tsx:79:19
   // const navigate = useNavigate();
   let timerID: number | null = null;
 
-  useEffect(() => {
-    if (status === "playing") {
-      timerID = window.setInterval(() => tick(), velocity);
-    } else {
-      !!timerID && window.clearInterval(timerID);
-      setTicks(0);
-    }
-    return () => {
-      !!timerID && window.clearInterval(timerID);
-    };
-  }, [ticks, status, velocity]);
+  useEffect(() => {}, [ticks, status, velocity]);
   const onXSizeChange = (size: number) => {
     !!probe && probe(size);

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:80:31
   let timerID: number | null = null;
 
   useEffect(() => {
-    if (status === "playing") {
-      timerID = window.setInterval(() => tick(), velocity);
-    } else {
+    if (status === "playing") {} else {
       !!timerID && window.clearInterval(timerID);
       setTicks(0);
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Timeout] ConditionalExpression
main/components/effects/MainEffects.tsx:80:9
   let timerID: number | null = null;
 
   useEffect(() => {
-    if (status === "playing") {
+    if (false) {
       timerID = window.setInterval(() => tick(), velocity);
     } else {

[Killed] ArrowFunction
main/components/effects/MainEffects.tsx:81:36
 
   useEffect(() => {
     if (status === "playing") {
-      timerID = window.setInterval(() => tick(), velocity);
+      timerID = window.setInterval(() => undefined, velocity);
     } else {
       !!timerID && window.clearInterval(timerID);
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Timeout] BlockStatement
main/components/effects/MainEffects.tsx:82:12
   useEffect(() => {
     if (status === "playing") {
       timerID = window.setInterval(() => tick(), velocity);
-    } else {
-      !!timerID && window.clearInterval(timerID);
-      setTicks(0);
-    }
+    } else {}
     return () => {
       !!timerID && window.clearInterval(timerID);

[Survived] ConditionalExpression
main/components/effects/MainEffects.tsx:83:7
     if (status === "playing") {
       timerID = window.setInterval(() => tick(), velocity);
     } else {
-      !!timerID && window.clearInterval(timerID);
+      false;
       setTicks(0);
     }

[Timeout] ConditionalExpression
main/components/effects/MainEffects.tsx:83:7
     if (status === "playing") {
       timerID = window.setInterval(() => tick(), velocity);
     } else {
-      !!timerID && window.clearInterval(timerID);
+      true;
       setTicks(0);
     }

[Survived] BlockStatement
main/components/effects/MainEffects.tsx:86:18
       !!timerID && window.clearInterval(timerID);
       setTicks(0);
     }
-    return () => {
-      !!timerID && window.clearInterval(timerID);
-    };
+    return () => {};
   }, [ticks, status, velocity]);
   const onXSizeChange = (size: number) => {

[Survived] ConditionalExpression
main/components/effects/MainEffects.tsx:87:7
       setTicks(0);
     }
     return () => {
-      !!timerID && window.clearInterval(timerID);
+      true;
     };
   }, [ticks, status, velocity]);

[Survived] ConditionalExpression
main/components/effects/MainEffects.tsx:87:7
       setTicks(0);
     }
     return () => {
-      !!timerID && window.clearInterval(timerID);
+      false;
     };
   }, [ticks, status, velocity]);

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:90:43
       !!timerID && window.clearInterval(timerID);
     };
   }, [ticks, status, velocity]);
-  const onXSizeChange = (size: number) => {
-    !!probe && probe(size);
-    dispatch(createSagaActionSetSizeX(size));
-  };
+  const onXSizeChange = (size: number) => {};
   const onYSizeChange = (size: number) => {
     !!probe && probe(size);
killedBy: MainEffects should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:91:5
     };
   }, [ticks, status, velocity]);
   const onXSizeChange = (size: number) => {
-    !!probe && probe(size);
+    true;
     dispatch(createSagaActionSetSizeX(size));
   };
killedBy: MainEffects should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:91:5
     };
   }, [ticks, status, velocity]);
   const onXSizeChange = (size: number) => {
-    !!probe && probe(size);
+    false;
     dispatch(createSagaActionSetSizeX(size));
   };
killedBy: MainEffects should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:94:43
     !!probe && probe(size);
     dispatch(createSagaActionSetSizeX(size));
   };
-  const onYSizeChange = (size: number) => {
-    !!probe && probe(size);
-    dispatch(createSagaActionSetSizeY(size));
-  };
+  const onYSizeChange = (size: number) => {};
   const tick = () => {
     !!probe && probe({});
killedBy: MainEffects should change Y size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:95:5
     dispatch(createSagaActionSetSizeX(size));
   };
   const onYSizeChange = (size: number) => {
-    !!probe && probe(size);
+    true;
     dispatch(createSagaActionSetSizeY(size));
   };
killedBy: MainEffects should change Y size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:95:5
     dispatch(createSagaActionSetSizeX(size));
   };
   const onYSizeChange = (size: number) => {
-    !!probe && probe(size);
+    false;
     dispatch(createSagaActionSetSizeY(size));
   };
killedBy: MainEffects should change Y size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:98:22
     !!probe && probe(size);
     dispatch(createSagaActionSetSizeY(size));
   };
-  const tick = () => {
-    !!probe && probe({});
-    dispatch(createSagaActionIncEpoch());
-    setTicks((ticks) => ticks + 1);
-  };
+  const tick = () => {};
   const run = () => {
     !!probe && probe({});
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:99:5
     dispatch(createSagaActionSetSizeY(size));
   };
   const tick = () => {
-    !!probe && probe({});
+    false;
     dispatch(createSagaActionIncEpoch());
     setTicks((ticks) => ticks + 1);
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:99:5
     dispatch(createSagaActionSetSizeY(size));
   };
   const tick = () => {
-    !!probe && probe({});
+    true;
     dispatch(createSagaActionIncEpoch());
     setTicks((ticks) => ticks + 1);
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] ArithmeticOperator
main/components/effects/MainEffects.tsx:101:25
   const tick = () => {
     !!probe && probe({});
     dispatch(createSagaActionIncEpoch());
-    setTicks((ticks) => ticks + 1);
+    setTicks((ticks) => ticks - 1);
   };
   const run = () => {
killedBy: MainEffects should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:103:21
     dispatch(createSagaActionIncEpoch());
     setTicks((ticks) => ticks + 1);
   };
-  const run = () => {
-    !!probe && probe({});
-    dispatch(actionSetStatus("playing"));
-  };
+  const run = () => {};
   const mute = () => {
     !!probe && probe({});
killedBy: MainEffects should Run automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:104:5
     setTicks((ticks) => ticks + 1);
   };
   const run = () => {
-    !!probe && probe({});
+    true;
     dispatch(actionSetStatus("playing"));
   };
killedBy: MainEffects should Run automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:104:5
     setTicks((ticks) => ticks + 1);
   };
   const run = () => {
-    !!probe && probe({});
+    false;
     dispatch(actionSetStatus("playing"));
   };
killedBy: MainEffects should Run automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:107:22
     !!probe && probe({});
     dispatch(actionSetStatus("playing"));
   };
-  const mute = () => {
-    !!probe && probe({});
-    dispatch(actionSetStatus("stopped"));
-  };
+  const mute = () => {};
   const clear = () => {
     !!probe && probe({});
killedBy: MainEffects should Stop automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:108:5
     dispatch(actionSetStatus("playing"));
   };
   const mute = () => {
-    !!probe && probe({});
+    true;
     dispatch(actionSetStatus("stopped"));
   };
killedBy: MainEffects should Stop automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:108:5
     dispatch(actionSetStatus("playing"));
   };
   const mute = () => {
-    !!probe && probe({});
+    false;
     dispatch(actionSetStatus("stopped"));
   };
killedBy: MainEffects should Stop automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:111:23
     !!probe && probe({});
     dispatch(actionSetStatus("stopped"));
   };
-  const clear = () => {
-    !!probe && probe({});
-    dispatch(actionSetStatus("stopped"));
-    dispatch(createSagaActionResetEpoch());
-  };
+  const clear = () => {};
   const fill = () => {
     !!probe && probe({});
killedBy: MainEffects should Clear field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:112:5
     dispatch(actionSetStatus("stopped"));
   };
   const clear = () => {
-    !!probe && probe({});
+    false;
     dispatch(actionSetStatus("stopped"));
     dispatch(createSagaActionResetEpoch());
killedBy: MainEffects should Clear field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:112:5
     dispatch(actionSetStatus("stopped"));
   };
   const clear = () => {
-    !!probe && probe({});
+    true;
     dispatch(actionSetStatus("stopped"));
     dispatch(createSagaActionResetEpoch());
killedBy: MainEffects should Clear field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:116:22
     dispatch(actionSetStatus("stopped"));
     dispatch(createSagaActionResetEpoch());
   };
-  const fill = () => {
-    !!probe && probe({});
-    dispatch(createSagaActionResetEpoch());
-    dispatch(createSagaFillField());
-  };
+  const fill = () => {};
   const setFillFactor = (factor: number) => {
     !!probe && probe(factor);
killedBy: MainEffects should Fill field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:117:5
     dispatch(createSagaActionResetEpoch());
   };
   const fill = () => {
-    !!probe && probe({});
+    false;
     dispatch(createSagaActionResetEpoch());
     dispatch(createSagaFillField());
killedBy: MainEffects should Fill field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:117:5
     dispatch(createSagaActionResetEpoch());
   };
   const fill = () => {
-    !!probe && probe({});
+    true;
     dispatch(createSagaActionResetEpoch());
     dispatch(createSagaFillField());
killedBy: MainEffects should Fill field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:121:45
     dispatch(createSagaActionResetEpoch());
     dispatch(createSagaFillField());
   };
-  const setFillFactor = (factor: number) => {
-    !!probe && probe(factor);
-    dispatch(createSagaSetFactor(factor));
-  };
+  const setFillFactor = (factor: number) => {};
   const setVelocity = (velocity: number) => {
     !!probe && probe(velocity);
killedBy: MainEffects should change Fill factor
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:122:5
     dispatch(createSagaFillField());
   };
   const setFillFactor = (factor: number) => {
-    !!probe && probe(factor);
+    false;
     dispatch(createSagaSetFactor(factor));
   };
killedBy: MainEffects should change Fill factor
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:122:5
     dispatch(createSagaFillField());
   };
   const setFillFactor = (factor: number) => {
-    !!probe && probe(factor);
+    true;
     dispatch(createSagaSetFactor(factor));
   };
killedBy: MainEffects should change Fill factor
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:125:45
     !!probe && probe(factor);
     dispatch(createSagaSetFactor(factor));
   };
-  const setVelocity = (velocity: number) => {
-    !!probe && probe(velocity);
-    dispatch(createSagaSetVelocity(velocity));
-  };
+  const setVelocity = (velocity: number) => {};
   const setAutomaton = (automaton: AutomatonDescription) => {
     !!probe && probe(automaton);
killedBy: MainEffects should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:126:5
     dispatch(createSagaSetFactor(factor));
   };
   const setVelocity = (velocity: number) => {
-    !!probe && probe(velocity);
+    false;
     dispatch(createSagaSetVelocity(velocity));
   };
killedBy: MainEffects should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:126:5
     dispatch(createSagaSetFactor(factor));
   };
   const setVelocity = (velocity: number) => {
-    !!probe && probe(velocity);
+    true;
     dispatch(createSagaSetVelocity(velocity));
   };
killedBy: MainEffects should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:129:61
     !!probe && probe(velocity);
     dispatch(createSagaSetVelocity(velocity));
   };
-  const setAutomaton = (automaton: AutomatonDescription) => {
-    !!probe && probe(automaton);
-    dispatch(createSagaSetAutomaton(automaton));
-  };
+  const setAutomaton = (automaton: AutomatonDescription) => {};
   const cellEvent = (cell: CellParams) => {
     !!probe && probe(cell);
killedBy: MainEffects should Set Automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:130:5
     dispatch(createSagaSetVelocity(velocity));
   };
   const setAutomaton = (automaton: AutomatonDescription) => {
-    !!probe && probe(automaton);
+    false;
     dispatch(createSagaSetAutomaton(automaton));
   };
killedBy: MainEffects should Set Automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:130:5
     dispatch(createSagaSetVelocity(velocity));
   };
   const setAutomaton = (automaton: AutomatonDescription) => {
-    !!probe && probe(automaton);
+    true;
     dispatch(createSagaSetAutomaton(automaton));
   };
killedBy: MainEffects should Set Automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/effects/MainEffects.tsx:133:43
     !!probe && probe(automaton);
     dispatch(createSagaSetAutomaton(automaton));
   };
-  const cellEvent = (cell: CellParams) => {
-    !!probe && probe(cell);
-    dispatch(actionToggleCell(cell.row, cell.col));
-  };
+  const cellEvent = (cell: CellParams) => {};
   const saveState = () => {
     !!probe && probe({});
killedBy: MainEffects should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:134:5
     dispatch(createSagaSetAutomaton(automaton));
   };
   const cellEvent = (cell: CellParams) => {
-    !!probe && probe(cell);
+    true;
     dispatch(actionToggleCell(cell.row, cell.col));
   };
killedBy: MainEffects should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:134:5
     dispatch(createSagaSetAutomaton(automaton));
   };
   const cellEvent = (cell: CellParams) => {
-    !!probe && probe(cell);
+    false;
     dispatch(actionToggleCell(cell.row, cell.col));
   };
killedBy: MainEffects should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
main/components/effects/MainEffects.tsx:137:27
     !!probe && probe(cell);
     dispatch(actionToggleCell(cell.row, cell.col));
   };
-  const saveState = () => {
-    !!probe && probe({});
-    dispatch(actionSagaSaveState(state));
-  };
+  const saveState = () => {};
   const restoreState = () => {
     !!probe && probe({});

[NoCoverage] ConditionalExpression
main/components/effects/MainEffects.tsx:138:5
     dispatch(actionToggleCell(cell.row, cell.col));
   };
   const saveState = () => {
-    !!probe && probe({});
+    true;
     dispatch(actionSagaSaveState(state));
   };

[NoCoverage] ConditionalExpression
main/components/effects/MainEffects.tsx:138:5
     dispatch(actionToggleCell(cell.row, cell.col));
   };
   const saveState = () => {
-    !!probe && probe({});
+    false;
     dispatch(actionSagaSaveState(state));
   };

[NoCoverage] BlockStatement
main/components/effects/MainEffects.tsx:141:30
     !!probe && probe({});
     dispatch(actionSagaSaveState(state));
   };
-  const restoreState = () => {
-    !!probe && probe({});
-    dispatch(actionSagaRestoreState());
-  };
+  const restoreState = () => {};
 
   return (

[NoCoverage] ConditionalExpression
main/components/effects/MainEffects.tsx:142:5
     dispatch(actionSagaSaveState(state));
   };
   const restoreState = () => {
-    !!probe && probe({});
+    false;
     dispatch(actionSagaRestoreState());
   };

[NoCoverage] ConditionalExpression
main/components/effects/MainEffects.tsx:142:5
     dispatch(actionSagaSaveState(state));
   };
   const restoreState = () => {
-    !!probe && probe({});
+    true;
     dispatch(actionSagaRestoreState());
   };

[Killed] StringLiteral
main/components/effects/MainEffects.tsx:178:32
             testId="sizex"
           />
         </div>
-        <div className={styles["knob-label"]}>Размер Y:</div>
+        <div className={styles[""]}>Размер Y:</div>
         <div>
           <Size
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -57,11 +57,11 @@

[Killed] StringLiteral
main/components/effects/MainEffects.tsx:195:32
             onAutomatonChange={setAutomaton}
           />
         </div>
-        <div className={styles["knob-label"]}>Скорость:</div>
+        <div className={styles[""]}>Скорость:</div>
         <div>
           <Velocity onVelocityChange={setVelocity} defVelocity={DEF_VELOCITY} />
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -248,11 +248,11 @@

[Killed] EqualityOperator
main/components/effects/MainEffects.tsx:202:21
         <div>
           <Button
             onAction={run}
-            status={status === "playing"}
+            status={status !== "playing"}
             caption="Эволюция"
             testId="actionrun"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -287,11 +287,11 @@

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:202:21
         <div>
           <Button
             onAction={run}
-            status={status === "playing"}
+            status={true}
             caption="Эволюция"
             testId="actionrun"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -287,11 +287,11 @@

[Killed] ConditionalExpression
main/components/effects/MainEffects.tsx:210:21
         <div>
           <Button
             onAction={mute}
-            status={status === "stopped"}
+            status={false}
             caption="Остановить"
             testId="actionstop"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -295,11 +295,11 @@

[Killed] EqualityOperator
main/components/effects/MainEffects.tsx:210:21
         <div>
           <Button
             onAction={mute}
-            status={status === "stopped"}
+            status={status !== "stopped"}
             caption="Остановить"
             testId="actionstop"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -295,11 +295,11 @@

[Killed] BooleanLiteral
main/components/effects/MainEffects.tsx:218:21
         <div>
           <Button
             onAction={clear}
-            status={false}
+            status={true}
             caption="Сбросить"
             testId="actionclear"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -303,11 +303,11 @@

[Killed] BooleanLiteral
main/components/effects/MainEffects.tsx:236:21
         <div>
           <Button
             onAction={fill}
-            status={false}
+            status={true}
             caption="Заполнить"
             testId="actionfill"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -324,11 +324,11 @@

[Killed] BooleanLiteral
main/components/effects/MainEffects.tsx:244:21
         <div>
           <Button
             onAction={saveState}
-            status={false}
+            status={true}
             caption="Сохранить"
             testId="actionSave"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -332,11 +332,11 @@

[Killed] BooleanLiteral
main/components/effects/MainEffects.tsx:252:21
         <div>
           <Button
             onAction={restoreState}
-            status={false}
+            status={true}
             caption="Восстановить"
             testId="actionRestore"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -340,11 +340,11 @@

[Killed] StringLiteral
main/components/effects/MainEffects.tsx:258:30
           />
         </div>
       </div>
-      <div className={styles["lifecontainer"]}>
+      <div className={styles[""]}>
         <Panel data={data} onChange={cellEvent} />
       </div>
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -348,11 +348,11 @@
