[Killed] ArrowFunction
main/components/native/MainNative.tsx:70:5
   status: "stopped",
   velocity: DEF_VELOCITY,
   automaton: AutomatonsList.filter(
-    (automaton) => automaton.id === DEF_AUTOMATON
+    () => undefined
   )[0],
 };
killedBy: Main should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading 'born')

[Killed] ConditionalExpression
main/components/native/MainNative.tsx:70:20
   status: "stopped",
   velocity: DEF_VELOCITY,
   automaton: AutomatonsList.filter(
-    (automaton) => automaton.id === DEF_AUTOMATON
+    (automaton) => false
   )[0],
 };
killedBy: Main should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading 'born')

[Killed] BlockStatement
main/components/native/MainNative.tsx:88:19
   //const navigate = useNavigate();
   const router = useRouter();
 
-  useEffect(() => {
-    if (state.status === "playing") {
-      timerId = window.setTimeout(tick, state.velocity);
-    }
-    return () => {
-      !!timerId && window.clearTimeout(timerId);
-    };
-  }, [state.status, state.epoch]);
+  useEffect(() => {}, [state.status, state.epoch]);
 
   const onXSizeChange = (size: number) => {
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] ConditionalExpression
main/components/native/MainNative.tsx:89:9
   const router = useRouter();
 
   useEffect(() => {
-    if (state.status === "playing") {
+    if (false) {
       timerId = window.setTimeout(tick, state.velocity);
     }
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] EqualityOperator
main/components/native/MainNative.tsx:89:9
   const router = useRouter();
 
   useEffect(() => {
-    if (state.status === "playing") {
+    if (state.status !== "playing") {
       timerId = window.setTimeout(tick, state.velocity);
     }
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Survived] BlockStatement
main/components/native/MainNative.tsx:92:18
     if (state.status === "playing") {
       timerId = window.setTimeout(tick, state.velocity);
     }
-    return () => {
-      !!timerId && window.clearTimeout(timerId);
-    };
+    return () => {};
   }, [state.status, state.epoch]);
 

[Survived] ConditionalExpression
main/components/native/MainNative.tsx:93:7
       timerId = window.setTimeout(tick, state.velocity);
     }
     return () => {
-      !!timerId && window.clearTimeout(timerId);
+      false;
     };
   }, [state.status, state.epoch]);

[Survived] ConditionalExpression
main/components/native/MainNative.tsx:93:7
       timerId = window.setTimeout(tick, state.velocity);
     }
     return () => {
-      !!timerId && window.clearTimeout(timerId);
+      true;
     };
   }, [state.status, state.epoch]);

[Killed] BlockStatement
main/components/native/MainNative.tsx:97:43
     };
   }, [state.status, state.epoch]);
 
-  const onXSizeChange = (size: number) => {
-    !!probe && probe(size);
-    setState((prevState) => {
-      const data = setXSize(prevState.data, size);
-      return { ...prevState, cols: data[0].length, data: data };
-    });
-  };
+  const onXSizeChange = (size: number) => {};
   const onYSizeChange = (size: number) => {
     !!probe && probe(size);
killedBy: Main should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:104:43
       return { ...prevState, cols: data[0].length, data: data };
     });
   };
-  const onYSizeChange = (size: number) => {
-    !!probe && probe(size);
-    setState((prevState) => {
-      const data = setYSize(prevState.data, size);
-      return { ...prevState, rows: data.length, data };
-    });
-  };
+  const onYSizeChange = (size: number) => {};
   const tick = () => {
     !!probe && probe({});
killedBy: Main should change Y size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:111:22
       return { ...prevState, rows: data.length, data };
     });
   };
-  const tick = () => {
-    !!probe && probe({});
-    setState((prevState) => ({
-      ...prevState,
-      epoch: prevState.epoch + 1,
-      data: CalcState(prevState.data, prevState.automaton),
-    }));
-  };
+  const tick = () => {};
   const run = () => {
     !!probe && probe({});
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Survived] ArithmeticOperator
main/components/native/MainNative.tsx:115:14
     !!probe && probe({});
     setState((prevState) => ({
       ...prevState,
-      epoch: prevState.epoch + 1,
+      epoch: prevState.epoch - 1,
       data: CalcState(prevState.data, prevState.automaton),
     }));

[Killed] BlockStatement
main/components/native/MainNative.tsx:119:21
       data: CalcState(prevState.data, prevState.automaton),
     }));
   };
-  const run = () => {
-    !!probe && probe({});
-    if (state.status === "stopped") {
-      setState((prevState) => ({
-        ...prevState,
-        status: "playing",
-      }));
-    }
-  };
+  const run = () => {};
   const mute = () => {
     !!probe && probe({});
killedBy: Main should Run automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/native/MainNative.tsx:121:9
   };
   const run = () => {
     !!probe && probe({});
-    if (state.status === "stopped") {
+    if (false) {
       setState((prevState) => ({
         ...prevState,
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] EqualityOperator
main/components/native/MainNative.tsx:121:9
   };
   const run = () => {
     !!probe && probe({});
-    if (state.status === "stopped") {
+    if (state.status !== "stopped") {
       setState((prevState) => ({
         ...prevState,
killedBy: Main should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] BlockStatement
main/components/native/MainNative.tsx:128:22
       }));
     }
   };
-  const mute = () => {
-    !!probe && probe({});
-    setState((prevState) => ({
-      ...prevState,
-      status: "stopped",
-    }));
-  };
+  const mute = () => {};
   const clear = () => {
     !!probe && probe({});
killedBy: Main should Stop automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:135:23
       status: "stopped",
     }));
   };
-  const clear = () => {
-    !!probe && probe({});
-    setState((prevState) => ({
-      ...prevState,
-      epoch: 0,
-      status: "stopped",
-      data: ClearState(state.data),
-    }));
-  };
+  const clear = () => {};
   const fill = () => {
     !!probe && probe({});
killedBy: Main should Clear field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:144:22
       data: ClearState(state.data),
     }));
   };
-  const fill = () => {
-    !!probe && probe({});
-    setState((prevState) => ({
-      ...prevState,
-      epoch: 0,
-      data: FillRandom(prevState.data, prevState.factor),
-    }));
-  };
+  const fill = () => {};
   const setFillFactor = (factor: number) => {
     !!probe && probe(factor);
killedBy: Main should Fill field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:152:45
       data: FillRandom(prevState.data, prevState.factor),
     }));
   };
-  const setFillFactor = (factor: number) => {
-    !!probe && probe(factor);
-    setState((prevState) => ({
-      ...prevState,
-      factor: factor,
-    }));
-  };
+  const setFillFactor = (factor: number) => {};
   const setVelocity = (velocity: number) => {
     !!probe && probe(velocity);
killedBy: Main should change Fill factor
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:159:45
       factor: factor,
     }));
   };
-  const setVelocity = (velocity: number) => {
-    !!probe && probe(velocity);
-    setState((prevState) => ({
-      ...prevState,
-      velocity: velocity,
-    }));
-  };
+  const setVelocity = (velocity: number) => {};
   const setAutomaton = (automaton: AutomatonDescription) => {
     !!probe && probe(automaton);
killedBy: Main should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:166:61
       velocity: velocity,
     }));
   };
-  const setAutomaton = (automaton: AutomatonDescription) => {
-    !!probe && probe(automaton);
-    setState((prevState) => ({
-      ...prevState,
-      automaton: automaton,
-    }));
-  };
+  const setAutomaton = (automaton: AutomatonDescription) => {};
   const cellEvent = (cell: CellParams) => {
     !!probe && probe(cell);
killedBy: Main should Set Automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/native/MainNative.tsx:173:43
       automaton: automaton,
     }));
   };
-  const cellEvent = (cell: CellParams) => {
-    !!probe && probe(cell);
-    setState((prevState) => ({
-      ...prevState,
-      data: SetCell(prevState.data, cell.row, cell.col),
-    }));
-  };
+  const cellEvent = (cell: CellParams) => {};
 
   return (
killedBy: Main should click Cell
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
main/components/native/MainNative.tsx:192:26
         </select>
         <p>{!!context ? context.user : ""}</p>
         <button
-          onClick={() => {
-            !!context && context.logout(() => router.push("/"));
-          }}
+          onClick={() => {}}
         >
           Выйти

[NoCoverage] ConditionalExpression
main/components/native/MainNative.tsx:193:13
         <p>{!!context ? context.user : ""}</p>
         <button
           onClick={() => {
-            !!context && context.logout(() => router.push("/"));
+            true;
           }}
         >

[NoCoverage] ArrowFunction
main/components/native/MainNative.tsx:193:41
         <p>{!!context ? context.user : ""}</p>
         <button
           onClick={() => {
-            !!context && context.logout(() => router.push("/"));
+            !!context && context.logout(() => undefined);
           }}
         >

[Killed] EqualityOperator
main/components/native/MainNative.tsx:236:21
         <div>
           <Button
             onAction={run}
-            status={state.status === "playing"}
+            status={state.status !== "playing"}
             caption="Эволюция"
             testId="actionrun"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -290,11 +290,11 @@

[Killed] ConditionalExpression
main/components/native/MainNative.tsx:236:21
         <div>
           <Button
             onAction={run}
-            status={state.status === "playing"}
+            status={true}
             caption="Эволюция"
             testId="actionrun"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -290,11 +290,11 @@

[Killed] ConditionalExpression
main/components/native/MainNative.tsx:244:21
         <div>
           <Button
             onAction={mute}
-            status={state.status === "stopped"}
+            status={false}
             caption="Остановить"
             testId="actionstop"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -298,11 +298,11 @@

[Killed] EqualityOperator
main/components/native/MainNative.tsx:244:21
         <div>
           <Button
             onAction={mute}
-            status={state.status === "stopped"}
+            status={state.status !== "stopped"}
             caption="Остановить"
             testId="actionstop"
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -298,11 +298,11 @@

[Timeout] StringLiteral
main/components/native/MainNative.tsx:257:32
             testId="actionclear"
           />
         </div>
-        <div className={styles["knob-label"]}>Заполнение:</div>
+        <div className={styles[""]}>Заполнение:</div>
         <div>
           <Size
