[Killed] EqualityOperator
main/components/redux/MainRedux.tsx:95:9
   let timerID: number | null = null;
 
   useEffect(() => {
-    if (status === "playing") {
+    if (status !== "playing") {
       timerID = window.setInterval(() => tick(), velocity);
     } else {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] ArrayDeclaration
main/components/redux/MainRedux.tsx:104:6
     return () => {
       !!timerID && window.clearInterval(timerID);
     };
-  }, [ticks, status, velocity]);
+  }, []);
   const onXSizeChange = (size: number) => {
     !!probe && probe(size);
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:105:43
       !!timerID && window.clearInterval(timerID);
     };
   }, [ticks, status, velocity]);
-  const onXSizeChange = (size: number) => {
-    !!probe && probe(size);
-    dispatch(actionSetSizeX(size));
-  };
+  const onXSizeChange = (size: number) => {};
   const onYSizeChange = (size: number) => {
     !!probe && probe(size);
killedBy: Main should change X size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:109:43
     !!probe && probe(size);
     dispatch(actionSetSizeX(size));
   };
-  const onYSizeChange = (size: number) => {
-    !!probe && probe(size);
-    dispatch(actionSetSizeY(size));
-  };
+  const onYSizeChange = (size: number) => {};
   const tick = () => {
     !!probe && probe({});
killedBy: MainRedux should change Y size
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:113:22
     !!probe && probe(size);
     dispatch(actionSetSizeY(size));
   };
-  const tick = () => {
-    !!probe && probe({});
-    dispatch(actionIncEpoch());
-    dispatch(actionNextEpoch(automaton));
-    setTicks((ticks) => ticks + 1);
-  };
+  const tick = () => {};
   const run = () => {
     !!probe && probe({});
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1

[Killed] ArithmeticOperator
main/components/redux/MainRedux.tsx:117:25
     !!probe && probe({});
     dispatch(actionIncEpoch());
     dispatch(actionNextEpoch(automaton));
-    setTicks((ticks) => ticks + 1);
+    setTicks((ticks) => ticks - 1);
   };
   const run = () => {
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:127:23
     !!probe && probe({});
     dispatch(actionSetStatus("stopped"));
   };
-  const clear = () => {
-    !!probe && probe({});
-    dispatch(actionSetStatus("stopped"));
-    dispatch(actionClearFeild());
-    dispatch(actionResetEpoch());
-  };
+  const clear = () => {};
   const fill = () => {
     !!probe && probe({});
killedBy: MainRedux should Clear field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:133:22
     dispatch(actionClearFeild());
     dispatch(actionResetEpoch());
   };
-  const fill = () => {
-    !!probe && probe({});
-    dispatch(actionFillField(factor));
-    dispatch(actionResetEpoch());
-  };
+  const fill = () => {};
   const setFillFactor = (factor: number) => {
     !!probe && probe(factor);
killedBy: MainRedux should Fill field
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:138:45
     dispatch(actionFillField(factor));
     dispatch(actionResetEpoch());
   };
-  const setFillFactor = (factor: number) => {
-    !!probe && probe(factor);
-    dispatch(actionSetFactor(factor));
-  };
+  const setFillFactor = (factor: number) => {};
   const setVelocity = (velocity: number) => {
     !!probe && probe(velocity);
killedBy: MainRedux should change Fill factor
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:142:45
     !!probe && probe(factor);
     dispatch(actionSetFactor(factor));
   };
-  const setVelocity = (velocity: number) => {
-    !!probe && probe(velocity);
-    dispatch(actionSetVelocity(velocity));
-  };
+  const setVelocity = (velocity: number) => {};
   const setAutomaton = (automaton: AutomatonDescription) => {
     !!probe && probe(automaton);
killedBy: MainRedux should Set Velocity
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/redux/MainRedux.tsx:146:61
     !!probe && probe(velocity);
     dispatch(actionSetVelocity(velocity));
   };
-  const setAutomaton = (automaton: AutomatonDescription) => {
-    !!probe && probe(automaton);
-    dispatch(actionSetAutomaton(automaton));
-  };
+  const setAutomaton = (automaton: AutomatonDescription) => {};
   const cellEvent = (cell: CellParams) => {
     !!probe && probe(cell);
killedBy: MainRedux should Set Automaton
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:154:27
     !!probe && probe(cell);
     dispatch(actionToggleCell(cell.row, cell.col));
   };
-  const saveState = () => {
-    !!probe && probe({});
-    if (useSaga) {
-      dispatch(actionSagaSaveState(state));
-    } else {
-      dispatch(actionSaveState());
-    }
-  };
+  const saveState = () => {};
   const restoreState = () => {
     !!probe && probe({});

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:156:18
   };
   const saveState = () => {
     !!probe && probe({});
-    if (useSaga) {
-      dispatch(actionSagaSaveState(state));
-    } else {
+    if (useSaga) {} else {
       dispatch(actionSaveState());
     }

[NoCoverage] ConditionalExpression
main/components/redux/MainRedux.tsx:156:9
   };
   const saveState = () => {
     !!probe && probe({});
-    if (useSaga) {
+    if (true) {
       dispatch(actionSagaSaveState(state));
     } else {

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:158:12
     !!probe && probe({});
     if (useSaga) {
       dispatch(actionSagaSaveState(state));
-    } else {
-      dispatch(actionSaveState());
-    }
+    } else {}
   };
   const restoreState = () => {

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:162:30
       dispatch(actionSaveState());
     }
   };
-  const restoreState = () => {
-    !!probe && probe({});
-    if (useSaga) {
-      dispatch(actionSagaRestoreState());
-    } else {
-      dispatch(actionLoadState());
-    }
-  };
+  const restoreState = () => {};
 
   return (

[NoCoverage] ConditionalExpression
main/components/redux/MainRedux.tsx:164:9
   };
   const restoreState = () => {
     !!probe && probe({});
-    if (useSaga) {
+    if (false) {
       dispatch(actionSagaRestoreState());
     } else {

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:164:18
   };
   const restoreState = () => {
     !!probe && probe({});
-    if (useSaga) {
-      dispatch(actionSagaRestoreState());
-    } else {
+    if (useSaga) {} else {
       dispatch(actionLoadState());
     }

[NoCoverage] BlockStatement
main/components/redux/MainRedux.tsx:166:12
     !!probe && probe({});
     if (useSaga) {
       dispatch(actionSagaRestoreState());
-    } else {
-      dispatch(actionLoadState());
-    }
+    } else {}
   };
 

[NoCoverage] StringLiteral
main/components/redux/MainRedux.tsx:180:40
           <option value="ReduxSaga">Redux (Saga)</option>
           <option value="ReduxEffects">Redux (Effects)</option>
         </select>
-        <p>{!!context ? context.user : ""}</p>
+        <p>{!!context ? context.user : "Stryker was here!"}</p>
         {/* <button
           onClick={() => {

[Killed] StringLiteral
main/components/redux/MainRedux.tsx:190:30
           Выйти
         </button> */}
       </div>
-      <div className={styles["control"]}>
+      <div className={styles[""]}>
         <div className={styles["knob-label"]}>Эпоха:</div>
         <div className={styles["epoch"]}>{epoch}</div>
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -31,11 +31,11 @@

[Timeout] ConditionalExpression
main/components/redux/MainRedux.tsx:227:21
         <div>
           <Button
             onAction={run}
-            status={status === "playing"}
+            status={false}
             caption="Эволюция"
             testId="actionrun"
