[Killed] BlockStatement
src/pages/signin/SignIn.tsx:26:61
   //const from = !!state ? state.from?.pathname : "/";
   const router = useRouter();
 
-  const onSubmit = (e: React.FormEvent<HTMLFormElement>) => {
-    e.preventDefault();
-    if (!!refUserName && !!refUserName.current && refUserName.current.value) {
-      !!probe && probe();
-      context?.login(refUserName.current.value);
-      //navigate(from || "/", { replace: true });
-      router.push("/");
-    }
-  };
+  const onSubmit = (e: React.FormEvent<HTMLFormElement>) => {};
   return (
     <form
killedBy: Control Submit fire event with context
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/pages/signin/SignIn.tsx:28:78
 
   const onSubmit = (e: React.FormEvent<HTMLFormElement>) => {
     e.preventDefault();
-    if (!!refUserName && !!refUserName.current && refUserName.current.value) {
-      !!probe && probe();
-      context?.login(refUserName.current.value);
-      //navigate(from || "/", { replace: true });
-      router.push("/");
-    }
+    if (!!refUserName && !!refUserName.current && refUserName.current.value) {}
   };
   return (
killedBy: Control Submit fire event with context
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/pages/signin/SignIn.tsx:29:7
   const onSubmit = (e: React.FormEvent<HTMLFormElement>) => {
     e.preventDefault();
     if (!!refUserName && !!refUserName.current && refUserName.current.value) {
-      !!probe && probe();
+      true;
       context?.login(refUserName.current.value);
       //navigate(from || "/", { replace: true });
killedBy: Control Submit fire event with context
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/pages/signin/SignIn.tsx:29:7
   const onSubmit = (e: React.FormEvent<HTMLFormElement>) => {
     e.preventDefault();
     if (!!refUserName && !!refUserName.current && refUserName.current.value) {
-      !!probe && probe();
+      false;
       context?.login(refUserName.current.value);
       //navigate(from || "/", { replace: true });
killedBy: Control Submit fire event with context
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/pages/signin/SignIn.tsx:32:19
       !!probe && probe();
       context?.login(refUserName.current.value);
       //navigate(from || "/", { replace: true });
-      router.push("/");
+      router.push("");
     }
   };
