[Survived] ConditionalExpression
src/services/store/StoreProvider.tsx:15:5
 };
 export const StoreProvider = ({ mode, children }: StoreProviderProps) => {
   switch (mode) {
-    case "Native":
-      return <>{children}</>;
+    case "Native":
     case "ReduxThunk":
       return <Provider store={storeThunk}>{children}</Provider>;

[Survived] ConditionalExpression
src/services/store/StoreProvider.tsx:17:5
   switch (mode) {
     case "Native":
       return <>{children}</>;
-    case "ReduxThunk":
-      return <Provider store={storeThunk}>{children}</Provider>;
+    case "ReduxThunk":
     case "ReduxSaga":
       return <Provider store={storeSaga}>{children}</Provider>;

[Survived] ConditionalExpression
src/services/store/StoreProvider.tsx:19:5
       return <>{children}</>;
     case "ReduxThunk":
       return <Provider store={storeThunk}>{children}</Provider>;
-    case "ReduxSaga":
-      return <Provider store={storeSaga}>{children}</Provider>;
+    case "ReduxSaga":
     case "ReduxEffects":
       return <Provider store={storeEffects}>{children}</Provider>;

[Survived] ConditionalExpression
src/services/store/StoreProvider.tsx:21:5
       return <Provider store={storeThunk}>{children}</Provider>;
     case "ReduxSaga":
       return <Provider store={storeSaga}>{children}</Provider>;
-    case "ReduxEffects":
-      return <Provider store={storeEffects}>{children}</Provider>;
+    case "ReduxEffects":
     default:
       return <>{children}</>;
