[Killed] ArrowFunction
src/store/ducks/automaton.ts:18:5
 export const SET_AUTOMATON = "cellular-automaton/automaton/set";
 export const initialState: State = {
   value: AutomatonsList.filter(
-    (automaton) => automaton.id === DEF_AUTOMATON
+    () => undefined
   )[0],
 };
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading 'save')

[Killed] ConditionalExpression
src/store/ducks/automaton.ts:18:20
 export const SET_AUTOMATON = "cellular-automaton/automaton/set";
 export const initialState: State = {
   value: AutomatonsList.filter(
-    (automaton) => automaton.id === DEF_AUTOMATON
+    (automaton) => false
   )[0],
 };
killedBy: MainRedux should fire Tick
statusReason: TypeError: Cannot read properties of undefined (reading 'born')

[Killed] ConditionalExpression
src/store/ducks/automaton.ts:27:5
   action: ActionAutomaton
 ): State {
   switch (action.type) {
-    case SET_AUTOMATON:
-      return {
-        ...state,
-        value: {
-          ...action.automaton,
-          born: [...action.automaton.born],
-          save: [...action.automaton.save],
-        },
-      };
+    case SET_AUTOMATON:
     default:
       return state;
killedBy: Automaton reducer
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Object {
    "value": Object {
      "born": Array [
