[Killed] ConditionalExpression
src/store/ducks/epoch.ts:20:5
   action: ActionEpoch
 ): State {
   switch (action.type) {
-    case RESET_EPOCH:
-      return {
-        ...state,
-        value: 0,
-      };
+    case RESET_EPOCH:
     case INC_EPOCH:
       return {
killedBy: Epoch reducer values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 0,
+   "value": 11,

[Killed] ConditionalExpression
src/store/ducks/epoch.ts:25:5
         ...state,
         value: 0,
       };
-    case INC_EPOCH:
-      return {
-        ...state,
-        value: state.value + 1,
-      };
+    case INC_EPOCH:
     default:
       return state;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10

[Killed] ArithmeticOperator
src/store/ducks/epoch.ts:28:16
     case INC_EPOCH:
       return {
         ...state,
-        value: state.value + 1,
+        value: state.value - 1,
       };
     default:
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 10
