[Killed] StringLiteral
src/store/ducks/factor.ts:11:31
   factor: number;
 };
 
-export const SET_FILLFACTOR = "cellular-automaton/factor/set";
+export const SET_FILLFACTOR = "";
 
 export const initialState: State = {
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "factor": 25,
-   "type": "cellular-automaton/factor/set",

[Killed] ConditionalExpression
src/store/ducks/factor.ts:21:5
   action: ActionFactor
 ): State {
   switch (action.type) {
-    case SET_FILLFACTOR:
-      return {
-        ...state,
-        value: action.factor,
-      };
+    case SET_FILLFACTOR:
     default:
       return state;
killedBy: Factor reducer values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 1,
+   "value": 25,
