[Killed] StringLiteral
src/store/ducks/gamelife.ts:20:27
   SetCell,
 } from "../../domain/engine";
 
-export const NEXT_EPOCH = "cellular-automaton/epoch/next";
+export const NEXT_EPOCH = "";
 export const CLEAR_FIELD = "cellular-automaton/field/clear";
 export const FILL_FIELD = "cellular-automaton/field/fill";
killedBy: Actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/epoch\//
Received string:  ""

[Killed] StringLiteral
src/store/ducks/gamelife.ts:21:28
 } from "../../domain/engine";
 
 export const NEXT_EPOCH = "cellular-automaton/epoch/next";
-export const CLEAR_FIELD = "cellular-automaton/field/clear";
+export const CLEAR_FIELD = "";
 export const FILL_FIELD = "cellular-automaton/field/fill";
 export const SET_SIZE_X = "cellular-automaton/sizex/set";
killedBy: Actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/field\//
Received string:  ""

[Killed] StringLiteral
src/store/ducks/gamelife.ts:22:27
 
 export const NEXT_EPOCH = "cellular-automaton/epoch/next";
 export const CLEAR_FIELD = "cellular-automaton/field/clear";
-export const FILL_FIELD = "cellular-automaton/field/fill";
+export const FILL_FIELD = "";
 export const SET_SIZE_X = "cellular-automaton/sizex/set";
 export const SET_SIZE_Y = "cellular-automaton/sizey/set";
killedBy: Actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/field\//
Received string:  ""

[Killed] StringLiteral
src/store/ducks/gamelife.ts:24:27
 export const CLEAR_FIELD = "cellular-automaton/field/clear";
 export const FILL_FIELD = "cellular-automaton/field/fill";
 export const SET_SIZE_X = "cellular-automaton/sizex/set";
-export const SET_SIZE_Y = "cellular-automaton/sizey/set";
+export const SET_SIZE_Y = "";
 export const TOGGLE_CELL = "cellular-automaton/cell/toggle";
 export const LOAD_FIELD = "cellular-automaton/field/load";
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "size": 50,
-   "type": "cellular-automaton/sizey/set",

[Killed] StringLiteral
src/store/ducks/gamelife.ts:26:27
 export const SET_SIZE_X = "cellular-automaton/sizex/set";
 export const SET_SIZE_Y = "cellular-automaton/sizey/set";
 export const TOGGLE_CELL = "cellular-automaton/cell/toggle";
-export const LOAD_FIELD = "cellular-automaton/field/load";
+export const LOAD_FIELD = "";
 export const IDLE = "cellular-automaton/idle";
 
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cellular-automaton/field/load"
Received: ""

[Killed] StringLiteral
src/store/ducks/gamelife.ts:27:21
 export const SET_SIZE_Y = "cellular-automaton/sizey/set";
 export const TOGGLE_CELL = "cellular-automaton/cell/toggle";
 export const LOAD_FIELD = "cellular-automaton/field/load";
-export const IDLE = "cellular-automaton/idle";
+export const IDLE = "";
 
 export type State = {
killedBy: Actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/idle/
Received string:  ""

[Killed] ConditionalExpression
src/store/ducks/gamelife.ts:88:5
   action: TAction
 ): State {
   switch (action.type) {
-    case NEXT_EPOCH:
-      return {
-        ...state,
-        data: CalcState(state.data, action.automaton),
-      };
+    case NEXT_EPOCH:
     case CLEAR_FIELD:
       return {
killedBy: Game Life reducer set epoch
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,11 +1,11 @@
  Object {
    "cols": 50,

[Survived] LogicalOperator
src/store/ducks/gamelife.ts:101:38
     case FILL_FIELD:
       return {
         ...state,
-        data: FillRandom(state.data, action.fillFactor || DEF_FILL),
+        data: FillRandom(state.data, action.fillFactor && DEF_FILL),
       };
     case SET_SIZE_X:

[Killed] ConditionalExpression
src/store/ducks/gamelife.ts:103:5
         ...state,
         data: FillRandom(state.data, action.fillFactor || DEF_FILL),
       };
-    case SET_SIZE_X:
-      if (action.size < MIN_COLS || action.size > MAX_COLS) {
-        return state;
-      }
-      return {
-        ...state,
-        cols: action.size,
-        data: setXSize(state.data, action.size),
-      };
+    case SET_SIZE_X:
     case SET_SIZE_Y:
       if (action.size < MIN_ROWS || action.size > MAX_ROWS) {
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 51
Received: 50

[Killed] ConditionalExpression
src/store/ducks/gamelife.ts:104:37
         data: FillRandom(state.data, action.fillFactor || DEF_FILL),
       };
     case SET_SIZE_X:
-      if (action.size < MIN_COLS || action.size > MAX_COLS) {
+      if (action.size < MIN_COLS || false) {
         return state;
       }
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 101

[Killed] BlockStatement
src/store/ducks/gamelife.ts:104:61
         data: FillRandom(state.data, action.fillFactor || DEF_FILL),
       };
     case SET_SIZE_X:
-      if (action.size < MIN_COLS || action.size > MAX_COLS) {
-        return state;
-      }
+      if (action.size < MIN_COLS || action.size > MAX_COLS) {}
       return {
         ...state,
killedBy: Game Life reducer set size X
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 101

[Killed] ConditionalExpression
src/store/ducks/gamelife.ts:113:37
         data: setXSize(state.data, action.size),
       };
     case SET_SIZE_Y:
-      if (action.size < MIN_ROWS || action.size > MAX_ROWS) {
+      if (action.size < MIN_ROWS || false) {
         return state;
       }
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 101

[Killed] BlockStatement
src/store/ducks/gamelife.ts:113:61
         data: setXSize(state.data, action.size),
       };
     case SET_SIZE_Y:
-      if (action.size < MIN_ROWS || action.size > MAX_ROWS) {
-        return state;
-      }
+      if (action.size < MIN_ROWS || action.size > MAX_ROWS) {}
       return {
         ...state,
killedBy: Game Life reducer set size Y
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 101

[Killed] ConditionalExpression
src/store/ducks/gamelife.ts:126:5
         ...state,
         data: SetCell(state.data, action.row, action.col),
       };
-    case LOAD_FIELD:
-      return {
-        ...state,
-        rows: action.data.length,
-        cols: action.data[0].length,
-        data: action.data.map((row) => row.map((cell) => cell)),
-      };
+    case LOAD_FIELD:
     default:
       return state;
killedBy: Game Life load field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2500
+ Received  + 2500

  Array [
    Array [
-     1,
