[Killed] StringLiteral
src/store/ducks/state.ts:22:35
 
 export const STATE_SAVE_CONFIRM = "cellular-automaton/state/save/confirm";
 export const STATE_SAVE_REJECT = "cellular-automaton/state/save/failed";
-export const STATE_LOAD_CONFIRM = "cellular-automaton/state/load/confirm";
+export const STATE_LOAD_CONFIRM = "";
 export const STATE_LOAD_REJECT = "cellular-automaton/state/load/failed";
 export const STATE_LOAD_UNKNOWN = "cellular-automaton/state/load/unknown";
killedBy: Epoch actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/state\/load\//
Received string:  ""

[Timeout] ConditionalExpression
src/store/ducks/state.ts:63:5
         ...state,
         error: "",
       };
-    case STATE_SAVE_REJECT:
-      return {
-        ...state,
-        error: action.error,
-      };
+    case STATE_SAVE_REJECT:
     case STATE_LOAD_CONFIRM:
       return {

[Timeout] ConditionalExpression
src/store/ducks/state.ts:73:5
         ...state,
         error: "",
       };
-    case STATE_LOAD_REJECT:
-      return {
-        ...state,
-        error: action.error,
-      };
+    case STATE_LOAD_REJECT:
     default:
       return state;

[Timeout] BlockStatement
src/store/ducks/state.ts:90:6
     ActionSaveStateConfim | ActionSaveStateReject
   >,
   getState: () => AppReduxState
-) => {
-  try {
-    await localStorage.setItem(
-      LOCAL_STORAGE_KEY,
-      JSON.stringify(getState())
-    );
-    dispatch(actionSaveStateConfirm());
-  } catch (e: unknown) {
-    dispatch(
-      actionSaveStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
-};
+) => {};
 export const thunkLoadState = async (
   dispatch: ThunkDispatch<

[Timeout] BlockStatement
src/store/ducks/state.ts:91:7
   >,
   getState: () => AppReduxState
 ) => {
-  try {
-    await localStorage.setItem(
-      LOCAL_STORAGE_KEY,
-      JSON.stringify(getState())
-    );
-    dispatch(actionSaveStateConfirm());
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     dispatch(
       actionSaveStateReject(

[NoCoverage] BlockStatement
src/store/ducks/state.ts:97:24
       JSON.stringify(getState())
     );
     dispatch(actionSaveStateConfirm());
-  } catch (e: unknown) {
-    dispatch(
-      actionSaveStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
+  } catch (e: unknown) {}
 };
 export const thunkLoadState = async (

[Timeout] BlockStatement
src/store/ducks/state.ts:120:6
     | ActionStatus
     | ActionVelocity
   >
-) => {
-  try {
-    const state = JSON.parse(
-      (await localStorage.getItem(LOCAL_STORAGE_KEY)) || ""
-    );
-    dispatch(actionLoadStateConfirm());
-    if (!!state) {
-      dispatch(actionSetStatus("stopped"));
-      dispatch(actionSetAutomaton(state.automaton.value));
-      dispatch(actionResetEpoch());
-      dispatch(actionSetFactor(state.factor.value));
-      dispatch(actionSetVelocity(state.velocity.value));
-      dispatch(actionSetSizeX(state.gameLife.data[0].length));
-      dispatch(actionSetSizeY(state.gameLife.data.length));
-      dispatch(actionLoadField(state.gameLife.data));
-    }
-  } catch (e: unknown) {
-    dispatch(
-      actionLoadStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
-};
+) => {};
 
 export const actionSaveState = () => thunkSaveState;

[Timeout] BlockStatement
src/store/ducks/state.ts:121:7
     | ActionVelocity
   >
 ) => {
-  try {
-    const state = JSON.parse(
-      (await localStorage.getItem(LOCAL_STORAGE_KEY)) || ""
-    );
-    dispatch(actionLoadStateConfirm());
-    if (!!state) {
-      dispatch(actionSetStatus("stopped"));
-      dispatch(actionSetAutomaton(state.automaton.value));
-      dispatch(actionResetEpoch());
-      dispatch(actionSetFactor(state.factor.value));
-      dispatch(actionSetVelocity(state.velocity.value));
-      dispatch(actionSetSizeX(state.gameLife.data[0].length));
-      dispatch(actionSetSizeY(state.gameLife.data.length));
-      dispatch(actionLoadField(state.gameLife.data));
-    }
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     dispatch(
       actionLoadStateReject(

[Killed] BooleanLiteral
src/store/ducks/state.ts:126:10
       (await localStorage.getItem(LOCAL_STORAGE_KEY)) || ""
     );
     dispatch(actionLoadStateConfirm());
-    if (!!state) {
+    if (!state) {
       dispatch(actionSetStatus("stopped"));
       dispatch(actionSetAutomaton(state.automaton.value));
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"status": "stopped", "type": "cellular-automaton/status/set"}
Received: undefined

[Killed] BlockStatement
src/store/ducks/state.ts:126:18
       (await localStorage.getItem(LOCAL_STORAGE_KEY)) || ""
     );
     dispatch(actionLoadStateConfirm());
-    if (!!state) {
-      dispatch(actionSetStatus("stopped"));
-      dispatch(actionSetAutomaton(state.automaton.value));
-      dispatch(actionResetEpoch());
-      dispatch(actionSetFactor(state.factor.value));
-      dispatch(actionSetVelocity(state.velocity.value));
-      dispatch(actionSetSizeX(state.gameLife.data[0].length));
-      dispatch(actionSetSizeY(state.gameLife.data.length));
-      dispatch(actionLoadField(state.gameLife.data));
-    }
+    if (!!state) {}
   } catch (e: unknown) {
     dispatch(
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"status": "stopped", "type": "cellular-automaton/status/set"}
Received: undefined

[NoCoverage] BlockStatement
src/store/ducks/state.ts:136:24
       dispatch(actionSetSizeY(state.gameLife.data.length));
       dispatch(actionLoadField(state.gameLife.data));
     }
-  } catch (e: unknown) {
-    dispatch(
-      actionLoadStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
+  } catch (e: unknown) {}
 };
 

[Killed] ArrowFunction
src/store/ducks/state.ts:145:32
   }
 };
 
-export const actionSaveState = () => thunkSaveState;
+export const actionSaveState = () => undefined;
 export const actionSaveStateConfirm = (): ActionSaveStateConfim => ({
   type: STATE_SAVE_CONFIRM,
killedBy: Thunk save state
statusReason: Error: Actions must be plain objects. Use custom middleware for async actions.

[Killed] ArrowFunction
src/store/ducks/state.ts:153:32
   error: string
 ): ActionSaveStateReject => ({ type: STATE_SAVE_REJECT, error });
 
-export const actionLoadState = () => thunkLoadState;
+export const actionLoadState = () => undefined;
 export const actionLoadStateConfirm = (): ActionLoadStateConfim => ({
   type: STATE_LOAD_CONFIRM,
killedBy: Thunk load state
statusReason: Error: Actions must be plain objects. Use custom middleware for async actions.
