[Killed] ConditionalExpression
src/store/ducks/status.ts:21:5
   action: ActionStatus
 ): State {
   switch (action.type) {
-    case SET_STATUS:
-      return {
-        ...state,
-        value: action.status,
-      };
+    case SET_STATUS:
     default:
       return state;
killedBy: MainRedux should fire Tick
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 11
Received number of calls: 1
