[Killed] StringLiteral
src/store/ducks/velocity.ts:3:29
 import { DEF_VELOCITY } from "../../domain/defaults";
 
-export const SET_VELOCITY = "cellular-automaton/velocity/set";
+export const SET_VELOCITY = "";
 export const SET_VELOCITY_UNKNOWN = "cellular-automaton/velocity/unknown";
 
killedBy: Thunk load state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "type": "cellular-automaton/velocity/set",
+   "type": "",

[Killed] StringLiteral
src/store/ducks/velocity.ts:4:37
 import { DEF_VELOCITY } from "../../domain/defaults";
 
 export const SET_VELOCITY = "cellular-automaton/velocity/set";
-export const SET_VELOCITY_UNKNOWN = "cellular-automaton/velocity/unknown";
+export const SET_VELOCITY_UNKNOWN = "";
 
 export type State = {
killedBy: Velocity actions naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /cellular-automaton\/velocity\//
Received string:  ""

[Killed] ConditionalExpression
src/store/ducks/velocity.ts:23:5
   action: ActionVelocity
 ) {
   switch (action.type) {
-    case SET_VELOCITY:
-      return {
-        ...state,
-        value: action.value,
-      };
+    case SET_VELOCITY:
     default:
       return state;
killedBy: Epoch reducer values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 1000,
+   "value": 100,
