[Killed] BlockStatement
src/store/effects/automaton.ts:19:67
   type: SET_AUTOMATON_SAGA,
   automaton,
 });
-export function* sagaSetAutomaton(action: SagaActionSetAutomaton) {
-  yield put(actionSetAutomaton(action.automaton));
-}
+export function* sagaSetAutomaton(action: SagaActionSetAutomaton) {}
 
killedBy: Set automaton saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
