[Killed] ArrowFunction
src/store/effects/epoch.ts:14:41
 type SagaActionSetEpoch = {
   type: typeof INC_EPOCH_SAGA | typeof RESET_EPOCH_SAGA;
 };
-export const createSagaActionIncEpoch = (): SagaActionSetEpoch => ({
-  type: INC_EPOCH_SAGA,
-});
+export const createSagaActionIncEpoch = () => undefined;
 export const createSagaActionResetEpoch = (): SagaActionSetEpoch => ({
   type: RESET_EPOCH_SAGA,
killedBy: Epoch saga actions objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "INC_EPOCH_SAGA"}
Received: undefined

[Killed] ArrowFunction
src/store/effects/epoch.ts:17:43
 export const createSagaActionIncEpoch = (): SagaActionSetEpoch => ({
   type: INC_EPOCH_SAGA,
 });
-export const createSagaActionResetEpoch = (): SagaActionSetEpoch => ({
-  type: RESET_EPOCH_SAGA,
-});
+export const createSagaActionResetEpoch = () => undefined;
 
 export function* sagaIncEpoch() {
killedBy: MainEffects should Clear field

[Killed] BlockStatement
src/store/effects/epoch.ts:21:33
   type: RESET_EPOCH_SAGA,
 });
 
-export function* sagaIncEpoch() {
-  const automaton: AutomatonDescription = yield select<
-    (state: AppReduxState) => AutomatonDescription
-  >((state) => {
-    console.log(state);
-    return state.automaton.value;
-  });
-  yield put(actionIncEpoch());
-  yield put(actionNextEpoch(automaton));
-}
+export function* sagaIncEpoch() {}
 
 export function* sagaResetEpoch() {
killedBy: Increment Epoch saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
src/store/effects/epoch.ts:32:35
   yield put(actionNextEpoch(automaton));
 }
 
-export function* sagaResetEpoch() {
-  yield put(actionResetEpoch());
-  yield put(actionClearFeild());
-}
+export function* sagaResetEpoch() {}
 
killedBy: Reset Epoch saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
