[Killed] StringLiteral
src/store/effects/factor.ts:5:37
 
 import { actionSetFactor } from "../ducks/factor";
 
-export const SET_FILL_FACTOR_SAGA = "SET_FILL_FACTOR_SAGA";
+export const SET_FILL_FACTOR_SAGA = "";
 
 type SagaActionSetFactor = {
killedBy: Factor saga naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /SET_FILL_FACTOR_SAGA/
Received string:  ""

[Killed] BlockStatement
src/store/effects/factor.ts:16:61
   type: SET_FILL_FACTOR_SAGA,
   factor,
 });
-export function* sagaSetFactor(action: SagaActionSetFactor) {
-  yield put(actionSetFactor(action.factor));
-}
+export function* sagaSetFactor(action: SagaActionSetFactor) {}
 
killedBy: Set Factor saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
