[Killed] ArrowFunction
src/store/effects/gamelife.ts:16:37
   type: typeof FILL_FIELD_SAGA;
 };
 
-export const createSagaClearField = (): SagaActionClearField => ({
-  type: CLEAR_FIELD_SAGA,
-});
+export const createSagaClearField = () => undefined;
 export const createSagaFillField = (): SagaActionFillField => ({
   type: FILL_FIELD_SAGA,
killedBy: Game Life saga actions objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "CLEAR_FIELD_SAGA"}
Received: undefined

[Killed] ArrowFunction
src/store/effects/gamelife.ts:19:36
 export const createSagaClearField = (): SagaActionClearField => ({
   type: CLEAR_FIELD_SAGA,
 });
-export const createSagaFillField = (): SagaActionFillField => ({
-  type: FILL_FIELD_SAGA,
-});
+export const createSagaFillField = () => undefined;
 export function* sagaClearField() {
   yield put(actionClearFeild());
killedBy: MainEffects should Fill field

[Killed] BlockStatement
src/store/effects/gamelife.ts:22:35
 export const createSagaFillField = (): SagaActionFillField => ({
   type: FILL_FIELD_SAGA,
 });
-export function* sagaClearField() {
-  yield put(actionClearFeild());
-}
+export function* sagaClearField() {}
 export function* sagaFillField() {
   const factor: number = yield select<(state: AppReduxState) => number>(
killedBy: Set Clear Field saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
src/store/effects/gamelife.ts:25:34
 export function* sagaClearField() {
   yield put(actionClearFeild());
 }
-export function* sagaFillField() {
-  const factor: number = yield select<(state: AppReduxState) => number>(
-    (state) => state.factor.value
-  );
-  yield put(actionFillField(factor));
-}
+export function* sagaFillField() {}
 
killedBy: Set Fill Field saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
