[Killed] BlockStatement
src/store/effects/sizes.ts:21:58
   type: SET_SIZE_Y_SAGA,
   size,
 });
-export function* sagaSetSizeX(action: SagaActionSetSize) {
-  yield put(actionSetSizeX(action.size));
-}
+export function* sagaSetSizeX(action: SagaActionSetSize) {}
 export function* sagaSetSizeY(action: SagaActionSetSize) {
   yield put(actionSetSizeY(action.size));
killedBy: Set Size X saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
src/store/effects/sizes.ts:24:58
 export function* sagaSetSizeX(action: SagaActionSetSize) {
   yield put(actionSetSizeX(action.size));
 }
-export function* sagaSetSizeY(action: SagaActionSetSize) {
-  yield put(actionSetSizeY(action.size));
-}
+export function* sagaSetSizeY(action: SagaActionSetSize) {}
 
killedBy: Set Size Y saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
