[Killed] BlockStatement
src/store/effects/velocity.ts:18:65
   type: SET_VELOCITY_SAGA,
   velocity,
 });
-export function* sagaSetVelocity(action: SagaActionSetVelocity) {
-  yield put(actionSetVelocity(action.velocity));
-}
+export function* sagaSetVelocity(action: SagaActionSetVelocity) {}
 
killedBy: Set Factor saga works
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
