[Killed] StringLiteral
src/store/sagas/StateSaga.ts:25:35
 export const LOCAL_STORAGE_KEY = "cellular-automaton.state";
 
 export const STATE_SAVE_SAGA = "STATE_SAVE_SAGA";
-export const STATE_RESTORE_SAGA = "STATE_RESTORE_SAGA";
+export const STATE_RESTORE_SAGA = "";
 
 export type SagaActionSaveStateRequest = {
killedBy: Sagas naming convention
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /STATE_RESTORE_SAGA/
Received string:  ""

[Killed] ArrowFunction
src/store/sagas/StateSaga.ts:41:39
   type: STATE_SAVE_SAGA,
   state,
 });
-export const actionSagaRestoreState = (): SagaActionRestoreStateRequest => ({
-  type: STATE_RESTORE_SAGA,
-});
+export const actionSagaRestoreState = () => undefined;
 
 export const saveState = (state: AppReduxState) =>
killedBy: Sagas Requests action objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "STATE_RESTORE_SAGA"}
Received: undefined

[Killed] ArrowFunction
src/store/sagas/StateSaga.ts:47:29
 
 export const saveState = (state: AppReduxState) =>
   localStorage.setItem(LOCAL_STORAGE_KEY, JSON.stringify(state));
-export const restoreState = () =>
-  JSON.parse(localStorage.getItem(LOCAL_STORAGE_KEY) || "");
+export const restoreState = () => undefined;
 
 export function* saveStateSaga(action: SagaActionSaveStateRequest) {
killedBy: Restore state saga api call correctly
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
src/store/sagas/StateSaga.ts:50:68
 export const restoreState = () =>
   JSON.parse(localStorage.getItem(LOCAL_STORAGE_KEY) || "");
 
-export function* saveStateSaga(action: SagaActionSaveStateRequest) {
-  try {
-    yield call(saveState, action.state);
-    yield put(actionSaveStateConfirm());
-  } catch (e) {
-    yield put(
-      actionSaveStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
-}
+export function* saveStateSaga(action: SagaActionSaveStateRequest) {}
 export function* restoreStateSaga() {
   try {
killedBy: Save state saga api call
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/store/sagas/StateSaga.ts:51:7
   JSON.parse(localStorage.getItem(LOCAL_STORAGE_KEY) || "");
 
 export function* saveStateSaga(action: SagaActionSaveStateRequest) {
-  try {
-    yield call(saveState, action.state);
-    yield put(actionSaveStateConfirm());
-  } catch (e) {
+  try {} catch (e) {
     yield put(
       actionSaveStateReject(
killedBy: Save state saga api call
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/store/sagas/StateSaga.ts:54:15
   try {
     yield call(saveState, action.state);
     yield put(actionSaveStateConfirm());
-  } catch (e) {
-    yield put(
-      actionSaveStateReject(
-        e instanceof Error ? e.message : "Local storage write error"
-      )
-    );
-  }
+  } catch (e) {}
 }
 export function* restoreStateSaga() {
killedBy: Save state saga api throw
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"@@redux-saga/IO": true, "combinator": false, "payload": {"action": {"error": "Test save state error", "type": "cellular-automaton/state/save/failed"}, "channel": undefined}, "type": "PUT"}
Received: undefined

[Killed] BlockStatement
src/store/sagas/StateSaga.ts:63:7
   }
 }
 export function* restoreStateSaga() {
-  try {
-    const state: AppReduxState = yield call(restoreState);
-    if (!!state) {
-      yield put(actionLoadStateConfirm());
-      yield put(actionSetStatus("stopped"));
-      yield put(actionSetAutomaton(state.automaton.value));
-      yield put(actionResetEpoch());
-      yield put(actionSetFactor(state.factor.value));
-      yield put(actionSetVelocity(state.velocity.value));
-      yield put(actionSetSizeX(state.gameLife.data[0].length));
-      yield put(actionSetSizeY(state.gameLife.data.length));
-      yield put(actionLoadField(state.gameLife.data));
-    } else {
-      yield put(
-        actionLoadStateReject("State not saved on the Local storage yet")
-      );
-    }
-  } catch (e) {
+  try {} catch (e) {
     yield put(
       actionLoadStateReject(
killedBy: Restore state saga api call
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"@@redux-saga/IO": true, "combinator": false, "payload": {"args": [], "context": null, "fn": [Function restoreState]}, "type": "CALL"}
Received: undefined

[Killed] ConditionalExpression
src/store/sagas/StateSaga.ts:65:9
 export function* restoreStateSaga() {
   try {
     const state: AppReduxState = yield call(restoreState);
-    if (!!state) {
+    if (false) {
       yield put(actionLoadStateConfirm());
       yield put(actionSetStatus("stopped"));
killedBy: Restore state saga api call correctly
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ConditionalExpression
src/store/sagas/StateSaga.ts:65:9
 export function* restoreStateSaga() {
   try {
     const state: AppReduxState = yield call(restoreState);
-    if (!!state) {
+    if (true) {
       yield put(actionLoadStateConfirm());
       yield put(actionSetStatus("stopped"));
killedBy: Restore state saga api call correctly
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[NoCoverage] BlockStatement
src/store/sagas/StateSaga.ts:75:12
       yield put(actionSetSizeX(state.gameLife.data[0].length));
       yield put(actionSetSizeY(state.gameLife.data.length));
       yield put(actionLoadField(state.gameLife.data));
-    } else {
-      yield put(
-        actionLoadStateReject("State not saved on the Local storage yet")
-      );
-    }
+    } else {}
   } catch (e) {
     yield put(

[NoCoverage] StringLiteral
src/store/sagas/StateSaga.ts:77:31
       yield put(actionLoadField(state.gameLife.data));
     } else {
       yield put(
-        actionLoadStateReject("State not saved on the Local storage yet")
+        actionLoadStateReject("")
       );
     }

[Killed] BlockStatement
src/store/sagas/StateSaga.ts:80:15
         actionLoadStateReject("State not saved on the Local storage yet")
       );
     }
-  } catch (e) {
-    yield put(
-      actionLoadStateReject(
-        e instanceof Error
-          ? e.message
-          : "Restore state from Local storage error"
-      )
-    );
-  }
+  } catch (e) {}
 }
 
killedBy: Restore state saga api throw
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"@@redux-saga/IO": true, "combinator": false, "payload": {"action": {"error": "Test restore state error", "type": "cellular-automaton/state/load/failed"}, "channel": undefined}, "type": "PUT"}
Received: undefined
