[Killed] StringLiteral
cellular-automaton/src/domain/defaults.ts:12:33
 export const DEF_FILL = 25;
 export const DEF_VELOCITY = 100;
 export const DEF_AUTOMATON = 15;
-export const EMPTY_CELL_COLOR = "#ececec";
+export const EMPTY_CELL_COLOR = "";
 
killedBy: App renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `App renders correctly 1`

- Snapshot  - 2500
+ Received  +    0

@@ -363,501 +363,451 @@
