[Survived] BlockStatement
src/store/effects/index.ts:35:29
 
 import rootReducer from "../ducks/reducer";
 
-export function* rootSaga() {
-  yield all([
-    takeEvery(SET_AUTOMATON_SAGA, sagaSetAutomaton),
-    takeEvery(INC_EPOCH_SAGA, sagaIncEpoch),
-    takeEvery(RESET_EPOCH_SAGA, sagaResetEpoch),
-    takeEvery(SET_FILL_FACTOR_SAGA, sagaSetFactor),
-    takeEvery(CLEAR_FIELD_SAGA, sagaClearField),
-    takeEvery(FILL_FIELD_SAGA, sagaFillField),
-    takeEvery(SET_SIZE_X_SAGA, sagaSetSizeX),
-    takeEvery(SET_SIZE_Y_SAGA, sagaSetSizeY),
-    takeEvery(SET_VELOCITY_SAGA, sagaSetVelocity),
-    takeEvery(STATE_SAVE_SAGA, saveStateSaga),
-    takeEvery(STATE_RESTORE_SAGA, restoreStateSaga),
-  ]);
-}
+export function* rootSaga() {}
 
 const sagaMiddleware = createSagaMiddleware();
