[Survived] BlockStatement
src/store/sagas/index.ts:14:29
 
 import rootReducer from "../ducks/reducer";
 
-export function* rootSaga() {
-  yield all([
-    takeEvery(STATE_SAVE_SAGA, saveStateSaga),
-    takeEvery(STATE_RESTORE_SAGA, restoreStateSaga),
-  ]);
-}
+export function* rootSaga() {}
 
 const sagaMiddleware = createSagaMiddleware();

[Survived] ArrayDeclaration
src/store/sagas/index.ts:15:13
 import rootReducer from "../ducks/reducer";
 
 export function* rootSaga() {
-  yield all([
-    takeEvery(STATE_SAVE_SAGA, saveStateSaga),
-    takeEvery(STATE_RESTORE_SAGA, restoreStateSaga),
-  ]);
+  yield all([]);
 }
 
